// Notifications
"MESSAGE_TEXT" = "%1$@: %2$@";
"MESSAGE_NOTEXT" = "%1$@ надіслав/ла повідомлення";
"MESSAGE_PHOTO" = "%1$@ надіслав/ла фотографію";
"MESSAGE_VIDEO" = "%1$@ надіслав/ла відеозапис";
"MESSAGE_CONTACT" = "%1$@ надіслав/ла контакт";
"MESSAGE_GEO" = "%1$@ надіслав/ла карту";
"MESSAGE_DOC" = "%1$@ надіслав/ла вам файл";
"MESSAGE_AUDIO" = "%1$@ надіслав/ла голосову замітку";
"MESSAGE_GIF" = "%1$@ надіслав/ла вам GIF";
"ENCRYPTED_MESSAGE" = "У вас нове повідомлення%1$@";
"LOCKED_MESSAGE" = "У вас нове повідомлення%1$@";
"ENCRYPTION_REQUEST" = "Новий запит на шифрування%1$@";
"ENCRYPTION_ACCEPT" = "Ваш запит на шифрування був прийнятий%1$@";
"DC_UPDATE" = "Натисніть це сповіщення, щоб оновити параметри програми";

"CHAT_JOINED" = "%1$@ приєднався/лась до групи %2$@";

"CHAT_MESSAGE_TEXT" = "%1$@@%2$@: %3$@";
"CHAT_MESSAGE_NOTEXT" = "%1$@ надіслав/ла повідомлення в групі %2$@";
"CHAT_MESSAGE_PHOTO" = "%1$@ надіслав/ла фотографію в групі %2$@";
"CHAT_MESSAGE_VIDEO" = "%1$@ надіслав/ла відеозапис в групі %2$@";
"CHAT_MESSAGE_CONTACT" = "%1$@ надіслав/ла контакт в групі %2$@";
"CHAT_MESSAGE_GEO" = "%1$@ надіслав/ла карту в групі %2$@";
"CHAT_MESSAGE_DOC" = "%1$@ надіслав/ла файл в групі %2$@";
"CHAT_MESSAGE_AUDIO" = "%1$@ надіслав/ла голосове повідомлення в групі %2$@";
"CHAT_MESSAGE_GIF" = "%1$@ надіслав/ла GIF до групи %2$@";
"CHAT_CREATED" = "%1$@ запросив/ла до групи %2$@";
"CHAT_TITLE_EDITED" = "%1$@ змінив/ла ім'я групи %2$@";
"CHAT_PHOTO_EDITED" = "%1$@ змінив/ла фотографію групи %2$@";
"CHAT_ADD_MEMBER" = "%1$@ запросив/ла %3$@ в групу %2$@";
"CHAT_ADD_YOU" = "%1$@ запросив/ла Вас в групу %2$@";
"CHAT_DELETE_YOU" = "%1$@ вилучив/ла вас з групи %2$@";
"CHAT_DELETE_MEMBER" = "%1$@ вилучив/ла %3$@ з групи %2$@";
"CHAT_LEFT" = "%1$@ покинув/ла групу %2$@";
"CHAT_RETURNED" = "%1$@ повернувся/лась з групи %2$@";

"MESSAGE_STICKER" = "%1$@ надіслав/ла наліпку";
"CHAT_MESSAGE_STICKER" = "%1$@ надіслав/ла наліпку в групі %2$@";

"CONTACT_JOINED" = "%1$@ приєднався/лась до Telegram!";
"CONTACT_ACTIVATED" = "%1$@ допоміг/ла активувати Ваш профіль!";

"AUTH_UNKNOWN" = "Вхід з нового пристрою: %1$@";
"AUTH_REGION" = "Вхід з нового пристрою: %1$@, місце знаходження:  %2$@";

"MESSAGE_FWDS" = "%1$@ переслав тобі %2$@ повідомлень";
"CHAT_MESSAGE_FWDS" = "%1$@ переслав/ла %3$@ повідомлення до групи %2$@";

"CHANNEL_MESSAGE_TEXT" = "%1$@: %2$@";
"CHANNEL_MESSAGE_NOTEXT" = "%1$@ опублікував/ла повідомлення";
"CHANNEL_MESSAGE_PHOTO" = "%1$@ опублікував/ла фотографію";
"CHANNEL_MESSAGE_VIDEO" = "%1$@ опублікував/ла відео";
"CHANNEL_MESSAGE_DOC" = "%1$@ опублікував/ла документ";
"CHANNEL_MESSAGE_STICKER" = "%1$@ опублікував/ла наліпку";
"CHANNEL_MESSAGE_AUDIO" = "%1$@ опублікував/ла голосове повідомлення";
"CHANNEL_MESSAGE_CONTACT" = "%1$@ опублікував/ла контакт";
"CHANNEL_MESSAGE_GEO" = "%1$@ опублікував/ла мапу";
"CHANNEL_MESSAGE_FWDS" = "%1$@ опублікував/ла %2$@ переслане повідомлення";
"CHANNEL_MESSAGE_GIF" = "%1$@ опублікував/ла GIF";

"PINNED_TEXT" = "%1$@ pinned \"%2$@\"";
"PINNED_NOTEXT" = "%1$@ pinned a message";
"PINNED_PHOTO" = "%1$@ pinned a photo";
"PINNED_VIDEO" = "%1$@ pinned a video";
"PINNED_DOC" = "%1$@ pinned a file";
"PINNED_STICKER" = "%1$@ pinned a sticker";
"PINNED_AUDIO" = "%1$@ pinned a voice message";
"PINNED_CONTACT" = "%1$@ pinned a contact";
"PINNED_GEO" = "%1$@ pinned a map";
"PINNED_GIF" = "%1$@ pinned a GIF";

// Common
"Common.OK" = "ОК";
"Common.Cancel" = "Скасувати";
"Common.Edit" = "Змінити";
"Common.edit" = "змінити";
"Common.Done" = "Готово";
"Common.Next" = "Далі";
"Common.Delete" = "Видалити";
"Common.Create" = "Створити";
"Common.Back" = "Назад";
"Common.Close" = "Закрити";
"Common.Yes" = "Так";
"Common.No" = "Ні";
"Common.TakePhotoOrVideo" = "Зняти фотографію або відеозапис";
"Common.TakePhoto" = "Зробити знімок";
"Common.ChoosePhoto" = "Вибрати фотографію";
"Common.ChooseVideo" = "Вибрати відеозапис";
"Common.of" = "із";
"Common.Search" = "Пошук";
"Common.More" = "Більше";
"Common.Select" = "Вибрати";

// State
"State.connecting" = "з'єднання";
"State.updating" = "оновлення";
"State.Connecting" = "З'єднання...";
"State.Updating" = "Оновлення...";
"State.WaitingForNetwork" = "Очікування мережі";

// Presence
"Presence.online" = "в мережі";
"Presence.offline" = "не в мережі";
"Presence.invisible" = "невидимий";

// Date
"Month.GenJanuary" = "січня";
"Month.GenFebruary" = "лютого";
"Month.GenMarch" = "березеня";
"Month.GenApril" = "квітня";
"Month.GenMay" = "травня";
"Month.GenJune" = "червня";
"Month.GenJuly" = "липня";
"Month.GenAugust" = "серпня";
"Month.GenSeptember" = "вересня";
"Month.GenOctober" = "жовтня";
"Month.GenNovember" = "листопада";
"Month.GenDecember" = "грудня";
"Month.ShortJanuary" = "січ";
"Month.ShortFebruary" = "лют";
"Month.ShortMarch" = "бер";
"Month.ShortApril" = "квіт";
"Month.ShortMay" = "трав";
"Month.ShortJune" = "черв";
"Month.ShortJuly" = "лип";
"Month.ShortAugust" = "серп";
"Month.ShortSeptember" = "вер";
"Month.ShortOctober" = "жовт";
"Month.ShortNovember" = "лист";
"Month.ShortDecember" = "груд";
"Weekday.ShortMonday" = "пн";
"Weekday.ShortTuesday" = "вт";
"Weekday.ShortWednesday" = "ср";
"Weekday.ShortThursday" = "чт";
"Weekday.ShortFriday" = "пт";
"Weekday.ShortSaturday" = "сб";
"Weekday.ShortSunday" = "нд";
"Weekday.Monday" = "понеділок";
"Weekday.Tuesday" = "вівторок";
"Weekday.Wednesday" = "середа";
"Weekday.Thursday" = "четвер";
"Weekday.Friday" = "п'ятниця";
"Weekday.Saturday" = "субота";
"Weekday.Sunday" = "неділя";

"Time.TodayAt" = "сьогодні в %@";
"Time.YesterdayAt" = "вчора в %@";

"LastSeen.JustNow" = "заходив/ла щойно";
"LastSeen.MinutesAgo_1" = "заходив/ла 1 хвилину тому"; //one
"LastSeen.MinutesAgo_2" = "заходив/ла 2 хвилини тому"; //two
"LastSeen.MinutesAgo_3_10" = "заходив/ла %@ хвилини тому"; //three to ten
"LastSeen.MinutesAgo_any" = "заходив/ла %@ хвилин тому"; // more than ten
"LastSeen.HoursAgo_1" = "заходив/ла 1 годину тому";
"LastSeen.HoursAgo_2" = "заходив/ла 2 години тому";
"LastSeen.HoursAgo_3_10" = "заходив/ла %@ години тому";
"LastSeen.HoursAgo_any" = "заходив/ла %@ годин тому";
"LastSeen.TodayAt" = "заходив/ла сьогодні в %@";
"LastSeen.YesterdayAt" = "заходив/ла вчора в %@";
"LastSeen.AtWeekday" = "заходив/ла %@";
"LastSeen.AtDate" = "заходив/ла %@";
"LastSeen.Lately" = "був/ла в мережі тільки що";
"LastSeen.WithinAWeek" = "був/ла в мережі протягом тижня";
"LastSeen.WithinAMonth" = "був/ла в мережі протягом місяця";
"LastSeen.ALongTimeAgo" = "був/ла в мережі дуже давно";

"Date.DialogDateFormat" = "{day} {month} ";

// Tour
"Tour.Title1" = "Telegram";
"Tour.Text1" = "**Найшвидша** у світі програма для спілкування.\nВона **безкоштовна** і **захищена**.";

"Tour.Title2" = "Швидкий";
"Tour.Text2" = "**Telegram** доставляє повідомлення\nшвидше, ніж будь-яка інша програма.";

"Tour.Title3" = "Потужний";
"Tour.Text3" = "В **Telegram** немає обмежень\nрозмірів для ваших чатів і медіа.";

"Tour.Title4" = "Захищений";
"Tour.Text4" = "**Telegram** захищає ваші повідомлення\nвід хакерських атак.";

"Tour.Title5" = "Хмарний";
"Tour.Text5" = "**Telegram** дозволяє вам отримувати\nдоступ до повідомлень з різних пристроїв.";

"Tour.Title6" = "Безкоштовний";
"Tour.Text6" = "**Telegram** безкоштовний, назавжди!\nНіякої реклами. Ніякої передплати.";

"Tour.Title7" = "Приватний";
"Tour.Text7" = "В **Telegram** повідомлення надійно шифруються і можуть самознищуватися.";

"Tour.StartButton" = "Почати спілкування";

// Login
"Login.PhoneAndCountryHelp" = "Будь ласка, перевірте код країни і вкажіть номер вашого телефону.";
"Login.CodeHelp" = "Ми відправили SMS з кодом перевірки на номер:\n%@";
"Login.CodeSentInternal" = "Ми надіслали код в програму **Telegram** на вашому іншому пристрої";
"Login.HaveNotReceivedCodeInternal" = "Не отримали код?";
"Login.CodeSentSms" = "Ми відправили вам SMS з кодом перевірки";
"Login.Code" = "Код";
"Login.CallRequestState1" = "Telegram зателефонує вам через %d:%.2d";
"Login.CallRequestState2" = "Запит дзвінка від Telegram...";
"Login.CallRequestState3" = "Telegram набрав ваш номер\n[Не отримали код?]";
"Login.EmailNotConfiguredError" = "Будь ласка, налаштуйте електронну пошту.";
"Login.EmailCodeSubject" = "%@, немає коду";
"Login.EmailCodeBody" = "Номер мого телефону:\n%@\nЯ не отримав код активації для Telegram.";
"Login.UnknownError" = "Сталася помилка. Будь ласка, спробуйте пізніше";
"Login.InvalidCodeError" = "Ви ввели неправильний код. Будь ласка, спробуйте ще раз.";
"Login.NetworkError" = "Будь ласка, перевірте з'єднання з інтернетом і повторіть спробу.";
"Login.CodeExpiredError" = "Термін дії коду завершився. Будь ласка, спробуйте знову.";
"Login.CodeFloodError" = "Досягнутий ліміт запитів. Будь ласка, спробуйте пізніше.";
"Login.InvalidPhoneError" = "Неправильний номер телефону. Будь ласка, спробуйте ще раз.";
"Login.InvalidFirstNameError" = "Неправильне ім'я. Будь ласка, спробуйте ще раз.";
"Login.InvalidLastNameError" = "Неправильне прізвище. Будь ласка, спробуйте ще раз.";
"Login.InactiveHelp" = "Ніхто з ваших контактів \nще не користується Telegram. \nМи повідомимо, як тільки хтось з'явиться. \nВи також можете запросити друзів самі.";
"Login.InviteButton" = "Запросити друга в чат";

"Login.PhoneTitle" = "Ваш телефон";
"Login.PhonePlaceholder" = "Ваш номер телефона";
"Login.CountryCode" = "Код країни";
"Login.InvalidCountryCode" = "Неправильний код країни";

"Login.CodeTitle" = "Ваш код";

"Login.InfoTitle" = "Інформація про вас";
"Login.InfoAvatarAdd" = "додати";
"Login.InfoAvatarPhoto" = "фотографія";
"Login.InfoFirstNamePlaceholder" = "Ім'я";
"Login.InfoLastNamePlaceholder" = "Прізвище";
"Login.InfoUpdatePhoto" = "Оновити фотографію";
"Login.InfoDeletePhoto" = "Видалити фотографію";
"Login.InfoHelp" = "Напишіть своє ім'я і завантажте фотографію профілю.";

// Login.SelectCountry
"Login.SelectCountry.Title" = "Країна";

// Welcome Screen
"WelcomeScreen.Title" = "Розпочнемо!";
"WelcomeScreen.Logout" = "Вийти";
"WelcomeScreen.Greeting" = "Ласкаво просимо, %@!";
"WelcomeScreen.ContactsAccessDisabled" = "Вибачте, не вдалося синхронізувати контакти.";
"WelcomeScreen.ContactsAccessHelp" = "Спілкування в Telegram базується на списку ваших контактів. Перейдіть в Параметри вашого %@ — Приватність — Контакти та увімкніть перемикач для Telegram.";
"WelcomeScreen.ContactsAccessSettings" = "Параметри";
"WelcomeScreen.UpdatingTitle" = "Оновлення";

// Dialog List
"DialogList.TabTitle" = "Чати";
"DialogList.Title" = "Чати";
"DialogList.SearchLabel" = "Пошук повідомлень чи користувачів";
"DialogList.SelectContact" = "Виберіть контакт";
"DialogList.SelectContacts" = "Виберіть контакти";
"DialogList.Create" = "Створити";
"DialogList.NoMessagesTitle" = "У вас ще немає повідомлень.";
"DialogList.NoMessagesText" = "Почніть спілкування натисканням на іконку олівця в правому верхньому кутку або за допомогою розділу «Контакти».";
"DialogList.SingleTypingSuffix" = "%@ набирає повідомлення";
"DialogList.SingleRecordingAudioSuffix" = "%@ записує аудіо";
"DialogList.SingleUploadingPhotoSuffix" = "%@ надсилає фотографію";
"DialogList.SingleUploadingVideoSuffix" = "%@ надсилає відеозапис";
"DialogList.SingleUploadingFileSuffix" = "%@ надсилає файл";
"DialogList.MultipleTypingSuffix" = "%d набирають повідомлення";
"DialogList.Typing" = "друкує";
"DialogList.ClearHistoryConfirmation" = "Очистити історію";
"DialogList.DeleteConversationConfirmation" = "Видалити і Вийти";
"DialogList.AwaitingEncryption" = "Чекаємо, коли %@ з'явиться в мережі...";
"DialogList.EncryptionRejected" = "Секретний чат розпущений";
"DialogList.EncryptionProcessing" = "Обмін ключами шифрування...";
"DialogList.EncryptedChatStartedOutgoing" = "%@ зайшов/ла в секретний чат.";
"DialogList.EncryptedChatStartedIncoming" = "%@ створив/ла секретний чат.";
"DialogList.Conversations" = "Розмови";
"DialogList.Messages" = "Повідомлення";

// Compose
"Compose.TokenListPlaceholder" = "Кому ви хочете написати?";
"Compose.NewMessage" = "Нове повідомлення";
"Compose.NewGroup" = "Нова група";
"Compose.NewEncryptedChat" = "Новий секретний чат";
"Compose.NewBroadcast" = "Список трансляції";
"Compose.NewBroadcastButton" = "Нова трансляція";
"Compose.Recipients" = "одержувачі";
"Compose.Create" = "Створити";

// Contacts
"Contacts.TabTitle" = "Контакти";
"Contacts.Title" = "Контакти";
"Contacts.Invite" = "Запросити";
"Contacts.contact" = "контакт";
"Contacts.contacts" = "контакти";
"Contacts.contactsvar" = "контакти";
"Contacts.InvitationText" = "Привіт! Переходь в Telegram http://telegram.org/dl";
"Contacts.FailedToSendInvitesMessage" = "Виникла помилка";
"Contacts.AccessDeniedError" = "У Telegram відсутній доступ до ваших контактів";
"Contacts.AccessDeniedHelpLandscape" = "Перейдіть в Параметри вашого %@ — Приватність — Контакти.\nПотім увімкніть перемикач для Telegram.";
"Contacts.AccessDeniedHelpPortrait" = "Перейдіть в Параметри вашого %@ — Приватність — Контакти. Потім увімкніть перемикач для Telegram.";
"Contacts.AccessDeniedHelpON" = "ВКЛ";
"Contacts.InviteToTelegram" = "Запросити в Telegram";
"Contacts.InviteFriends" = "Запросити друзів";
"Contacts.SelectAll" = "Вибрати все";

// Conversation
"Conversation.InputTextPlaceholder" = "Повідомлення";
"Conversation.Send" = "Надіслати";
"Conversation.typing" = "вводить";
"Conversation.MessageDeliveryFailed" = "Ваше повідомлення не було надіслано. Натисніть «Повторити», щоб зробити це.";
"Conversation.MessageDialogEdit" = "Редагувати";
"Conversation.MessageDialogRetry" = "Надіслати повторно";
"Conversation.MessageDialogRetryAll" = "Надіслати повторно %1$d";
"Conversation.MessageDialogDelete" = "Видалити";
"Conversation.LinkDialogOpen" = "Відкрити";
"Conversation.LinkDialogCopy" = "Копіювати";
"Conversation.EditDelete" = "Видалити";
"Conversation.EditForward" = "Переслати";
"Conversation.ForwardToPersonFormat" = "Переслати %@?";
"Conversation.ForwardToGroupFormat" = "Переслати %@?";
"Conversation.ForwardTitle" = "Переслати";
"Conversation.ForwardChats" = "Чати";
"Conversation.ForwardContacts" = "Контакти";
"Conversation.StatusKickedFromGroup" = "вас було вилучено з групи";
"Conversation.StatusLeftGroup" = "ви покинули групу";
"Conversation.StatusTyping" = "набирає";
"Conversation.BroadcastTitle" = "Транслювати";
"Conversation.Call" = "Зателефонувати";
"Conversation.Mute" = "Вимкнути";
"Conversation.Unmute" = "Увімкнути";
"Conversation.Edit" = "Змінити";
"Conversation.Info" = "Інформація";
"Conversation.Search" = "Пошук";
"Conversation.Block" = "Заблокувати";
"Conversation.Unblock" = "Розблокувати";
"Conversation.ClearAll" = "Видалити все";
"Conversation.Location" = "Місце розташування";
"Conversation.Document" = "Надіслати файл";
"Conversation.Contact" = "Контакт";
"Conversation.BlockUser" = "Заблокувати користувача";
"Conversation.UnblockUser" = "Розблокувати користувача";
"Conversation.DeleteGroup" = "Видалити цю групу";
"Conversation.DeleteChat" = "Видалити цей чат";
"Conversation.ClearAllConfirmation" = "Видалити всі повідомлення?";
"Conversation.SearchImages" = "Пошук зображень";
"Conversation.UnsupportedMedia" = "Це повідомлення не підтримується вашою версією Telegram. Оновіть додаток, щоб побачити його:\nhttp://telegram.org/update";
"Conversation.EncryptionWaiting" = "Чекаємо, коли %@ з'явиться в мережі...";
"Conversation.EncryptionProcessing" = "Обмін ключами шифрування...";
"Conversation.SupportPlaceholder" = "Є питання щодо Telegram?";
"Conversation.EmptyPlaceholder" = "Повідомлень поки немає...";
"Conversation.EncryptedPlaceholderTitleIncoming" = "%@ запросив/ла вас в секретний чат";
"Conversation.EncryptedPlaceholderTitleOutgoing" = "Ви запросили %@ приєднатися до секретного чату.";
"Conversation.EncryptedDescriptionTitle" = "Секретні чати:";
"Conversation.EncryptedDescription1" = "Викор. наскрізне шифрування";
"Conversation.EncryptedDescription2" = "Не залишають слідів";
"Conversation.EncryptedDescription3" = "Мають таймери самознищення";
"Conversation.EncryptedDescription4" = "Не можна пересилати";
"Conversation.EncryptedForwardingAlert" = "Вибачте, але ви не можете переслати повідомлення з секретного чату.";
"Conversation.ContextMenuCopy" = "Копіювати";
"Conversation.ContextMenuDelete" = "Видалити";
"Conversation.ContextMenuForward" = "Переслати";
"Conversation.ContextMenuMore" = "Більше...";

"Conversation.StatusMembers_1" = "1 часник";
"Conversation.StatusMembers_2" = "2 учасника";
"Conversation.StatusMembers_3_10" = "Учасників: %@";
"Conversation.StatusMembers_any" = "Учасників: %@";

"Conversation.StatusRecipients_1" = "1 одержувач";
"Conversation.StatusRecipients_2" = "2 одержувачів";
"Conversation.StatusRecipients_3_10" = "Одержувачів: %@";
"Conversation.StatusRecipients_any" = "Одержувачів: %@";

"Conversation.StatusOnline_1" = "1 в мережі";
"Conversation.StatusOnline_2" = "2 в мережі";
"Conversation.StatusOnline_3_10" = "%@ в мережі";
"Conversation.StatusOnline_any" = "%@ в мережі";

"Conversation.UnreadMessages" = "Непрочитані повідомлення";
"Conversation.InfoGroup" = "Групи";
"Conversation.InfoPrivate" = "Контакт";
"Conversation.InfoBroadcastList" = "Список";

// Notification
"Notification.RenamedChat" = "%@ перейменував/ла групу";
"Notification.RenamedChannel" = "Канал перейменовано";
"Notification.ChangedGroupPhoto" = "%@ змінив/ла фотографію групи";
"Notification.RemovedGroupPhoto" = "%@ видалив/ла фотографію групи";
"Notification.ChangedUserPhoto" = "%@ додав/ла нове фото профілю";
"Notification.RemovedUserPhoto" = "%@ видалив/ла фото профілю";
"Notification.JoinedChat" = "%@ приєднався/лась до групи";
"Notification.Invited" = "%@ запросив/ла %@";
"Notification.LeftChat" = "%@ покинув/ла групу";
"Notification.Kicked" = "%@ вилучив/ла %@";
"Notification.CreatedChat" = "%@ створив/ла групу";
"Notification.CreatedChannel" = "Канал створено";
"Notification.CreatedGroup" = "Група створена";
"Notification.CreatedBroadcastList" = "Ви створили список трансляції";
"Notification.CreatedChatWithTitle" = "%@ створив/ла гурупу «%@»";
"Notification.Joined" = "%@ приєднався/лась до Telegram";
"Notification.ChangedGroupName" = "%@ змінив/ла назву групи на «%@»";
"Notification.NewAuthDetected" = "%1$@,\nМи виявили вхід у ваш обліковий запис з нового пристрою %2$@, %3$@ о %4$@\n\nПристрій: %5$@\nРозташування: %6$@\n\nЯкщо це були не ви, можете перейти в Параметри  — Приватність і безпека — Сеанси, і видалити той сеанс.\n\nЯкщо ви вважаєте, що хтось увійшов у ваш обліковий запис без вашого дозволу, ви можете увімкнути двоетапну перевірку в Параметрах Приватності й безпеки.\n\nЩиро ваша,\nКоманда Telegram";
"Notification.EncryptedChatRequested" = "Секретний чат запитаний";
"Notification.EncryptedChatAccepted" = "Секретний чат створений";
"Notification.MessageLifetimeChanged" = "%1$@ встановив/ла таймер самознищенняjavascript:; на %2$@";
"Notification.MessageLifetimeChangedOutgoing" = "Ви встановили таймер самознищення на %1$@";
"Notification.MessageLifetimeRemoved" = "%1$@ відключив/ла таймер самознищення";
"Notification.MessageLifetimeRemovedOutgoing" = "Ви відключили таймер самознищення";
"Notification.MessageLifetime2s" = "2 секунди";
"Notification.MessageLifetime5s" = "5 секунд";
"Notification.MessageLifetime1m" = "1 хвилина";
"Notification.MessageLifetime1h" = "1 година";
"Notification.MessageLifetime1d" = "1 день";
"Notification.MessageLifetime1w" = "1 тиждень";

// Message
"Message.Photo" = "Фотографія";
"Message.Video" = "Відеозапис";
"Message.Location" = "Місцерозташування";
"Message.Contact" = "Контакт";
"Message.File" = "Файл";
"Message.Sticker" = "Наліпка";
"Message.Audio" = "Голосове повідомлення";
"Message.ForwardedMessage" = "Переслане повідомлення\nВід: %@";
"Message.SharedContact" = "Контакт";
"Message.Animation" = "GIF";

// Conversation Profile
"ConversationProfile.ErrorCreatingConversation" = "Виникла помилка.";
"ConversationProfile.UserLeftChatError" = "Вибачте, %@ самостійно покинув/ла групу, тому ви не можете повернути його/її назад.";
"ConversationProfile.UnknownAddMemberError" = "Сталася неочікувана помилка. Наші фахівці вже повідомлені і вирішать її якомога швидше. Приносимо свої вибачення.";
"ConversationProfile.UsersTooMuchError" = "На жаль, група переповнена. Ви більше не можете запрошувати в неї нових учасників.";

"ConversationProfile.LeaveDeleteAndExit" = "Видалити і Вийти";

"Conversation.DownloadPhoto" = "Завантажити фотографію";
"Conversation.ViewPhoto" = "Подивитися фотографію";
"Conversation.PlayVideo" = "Відтворити відеозапис";
"Conversation.Play" = "Відтворити ";
"Conversation.Stop" = "Стоп";
"Conversation.ViewFile" = "Переглянути файл";
"Conversation.Download" = "Завантажити";
"Conversation.DownloadMegabytes" = "Завантажити %.1fMb";
"Conversation.DownloadKilobytes" = "Завантажити %dKb";
"Conversation.Megabytes" = "%.1fMb";
"Conversation.Kilobytes" = "%dKb";
"Conversation.Bytes" = "%db";
"Conversation.DownloadProgressMegabytes" = "%1$.1fMb / %2$.1fMb";
"Conversation.DownloadProgressKilobytes" = "%1$dKb / %2$dKb";
"Conversation.ViewLocation" = "Переглянути місцерозташування";
"Conversation.SearchWebImages" = "Знайти зображення";
"Conversation.ShareMyContactInfo" = "Відправити мій контакт";
"Conversation.AddContact" = "Додати контакт";
"Conversation.SendMessage" = "Надіслати повідомлення";
"Conversation.EncryptionCanceled" = "Секретний чат скасований";
"Conversation.DeleteOneMessage" = "Видалити повідомлення";
"Conversation.DeleteManyMessages" = "Видалити повідомлення";
"Conversation.View" = "Переглянути";
"Conversation.Download" = "Завантажити";
"Conversation.SlideToCancel" = "Проведіть для скасування";
"Conversation.ApplyLocalization" = "Застосувати локалізацію";
"Conversation.OpenFile" = "Відкрити файл";
"Conversation.MicrophoneAccessDisabled" = "Telegram потребує доступу до вашого мікрофона для надсилання голосових повідомлень. Перейдіть в Параметри — Приватність — Мікрофон і увімкніть перемикач для Telegram.";

// Media Picker
"MediaPicker.Send" = "Надіслати";
"MediaPicker.Choose" = "Вибрати";
"SearchImages.SearchImages" = "Пошук зображень";
"SearchImages.Title" = "Альбоми";
"MediaPicker.CameraRoll" = "Фотопоток";
"SearchImages.NoImagesFound" = "Зображення не знайдені";
"MediaPicker.AccessDeniedError" = "У Telegram отсутсвует доступ до ваших фотографій";
"MediaPicker.AccessDeniedHelp" = "Перейдіть в Параметри вашого %@ — Приватність — Фотографії \nПотім увімкніть перемикач для Telegram.";
"SearchImages.Downloading#Kb" = "Завантаження %d Kb";
"SearchImages.Downloading#Mb" = "Завантаження %d Mb";
"SearchImages.ImageNofM" = "Зображення %1$@ із %2$@";
"SearchImages.DownloadCancelled" = "Завантаження скасовано";
"SearchImages.ErrorDownloadingImage" = "Помилка завантаження зображення";
"SearchImages.SkipImage" = "Пропустити зображення";
"SearchImages.RetryDownload" = "Повторити завантаження";

// User Profile
"Profile.ImageUploadError" = "Сталася помилка. Будь ласка, спробуйте пізніше.";
"Profile.PhonebookAccessDisabled" = "Щоб ця функція запрацювала, перейдіть в Параметри вашого iPhone в розділ — Приватність  — Контакти і увімкніть перемикач для Telegram.";
"Profile.CreateEncryptedChatError" = "Сталася помилка.";
"Profile.CreateEncryptedChatOutdatedError" = "Не вдається створити секретний чат c %@.\n%@ використовує застарілу версію Telegram.";
"Profile.CreateNewContact" = "Створити новий контакт";
"Profile.AddToExisting" = "Додати в наявний";
"Profile.EncryptionKey" = "Ключ шифрування";
"Profile.MessageLifetime" = "Таймер самознищення";
"Profile.MessageLifetimeForever" = "Вкл";
"Profile.MessageLifetime2s" = "2 сек";
"Profile.MessageLifetime5s" = "5 сек";
"Profile.MessageLifetime1m" = "1 хв";
"Profile.MessageLifetime1h" = "1 год";
"Profile.MessageLifetime1d" = "1 дн";
"Profile.MessageLifetime1w" = "1 тиж";
"Profile.ShareContactButton" = "Відправити контакт";
"Profile.ShareContactPersonFormat" = "Відправити контакт %@?";
"Profile.ShareContactGroupFormat" = "Відправити контакт %@?";

// User Info
"UserInfo.Title" = "Інформація";
"UserInfo.FirstNamePlaceholder" = "Ім'я";
"UserInfo.LastNamePlaceholder" = "Прізвище";
"UserInfo.GenericPhoneLabel" = "стільниковий";
"UserInfo.SendMessage" = "Надіслати повідомлення";
"UserInfo.AddContact" = "Додати контакт";
"UserInfo.ShareContact" = "Надіслати контакт";
"UserInfo.StartSecretChat" = "Почати секретний чат";
"UserInfo.DeleteContact" = "Видалити контак";
"UserInfo.CreateNewContact" = "Створити новий контакт";
"UserInfo.AddToExisting" = "Добавити в наявний";
"UserInfo.AddPhone" = "додати телефон";
"UserInfo.NotificationsEnabled" = "Увімкнено";
"UserInfo.NotificationsDisabled" = "Вимкнено";
"UserInfo.NotificationsEnable" = "Увімкнено";
"UserInfo.NotificationsDisable" = "Вимкнено";
"UserInfo.Invite" = "Запросити в Telegram";

// New Contact
"NewContact.Title" = "Новий контакт";

// Phone Label
"PhoneLabel.Title" = "Етикетка";

// Secret Chat
"SecretChat.Title" = "Секретний чат.";

// Group Info
"GroupInfo.Title" = "Інформація";
"GroupInfo.GroupNamePlaceholder" = "Назва групи";
"GroupInfo.BroadcastListNamePlaceholder" = "Назва списка";
"GroupInfo.SetGroupPhoto" = "Встановити фотографію групи";
"GroupInfo.SetGroupPhotoStop" = "Стоп";
"GroupInfo.SetGroupPhotoDelete" = "Видалити фотографію";
"GroupInfo.Notifications" = "Сповіщення";
"GroupInfo.Sound" = "Звук";
"GroupInfo.SharedMedia" = "Спільні медіа";
"GroupInfo.SharedMediaNone" = "Немає";
"GroupInfo.DeleteAndExit" = "Видалити і Вийти";
"GroupInfo.DeleteAndExitConfirmation" = "Ви не зможете увійти в цю групу знову";
"GroupInfo.ParticipantCount_1" = "1 УЧАСНИК";
"GroupInfo.ParticipantCount_2" = "2 УЧАСНИКА";
"GroupInfo.ParticipantCount_3_10" = "%@ УЧАСНИКІВ";
"GroupInfo.ParticipantCount_any" = "%@ УЧАСНИКІВ";
"GroupInfo.AddParticipant" = "Додати учасника";
"GroupInfo.AddParticipantTitle" = "Контакти";
"GroupInfo.AddParticipantConfirmation" = "Добавити %@ в групу?";
"GroupInfo.KickedStatus" = "Вас було вилучено з групи";
"GroupInfo.LeftStatus" = "Ви покинули групу";

// Encryption Key
"EncryptionKey.Title" = "Ключ шифрування";
"EncryptionKey.Description" = "Це зображення і текст були отримані з ключа шифрування для цього секретного чату за допомогою %1$@.\n\n Якщо ключ виглядає однаково на пристрої %2$@, в такому разі шифрування гарантоване.\n\nДокладніше на telegram.org";

// Conversation media
"ConversationMedia.Title" = "Медіа";
"ConversationMedia.EmptyTitle" = "Немає фотографій чи відео";

// Preview
"Preview.VideoNotYetDownloaded" = "Спочатку завантажте відео.";
"Preview.GroupPhotoTitle" = "Фотографія групи";
"Preview.ProfilePhotoTitle" = "Фотографія профілю";
"Preview.LoadingVideo" = "завантаження відео...";
"Preview.LoadingImage" = "завантаження повного зображення...";
"Preview.LoadingImages" = "завантаження повних зображень...";
"Preview.DeletePhoto" = "Видалити фотографію";
"Preview.DeleteVideo" = "Видалити відео";
"Preview.ForwardViaTelegram" = "Переслати через Telegram";
"Preview.SaveToCameraRoll" = "Зберегти в фотопотік";

// Map
"Map.ChooseLocationTitle" = "Розташування";
"Map.MapTitle" = "Карта";
"Map.Send" = "Надіслати";
"Map.Map" = "Карта";
"Map.Satellite" = "Супутник";
"Map.Hybrid" = "Гібрид";
"Map.AccessDeniedError" = "Щоб ця функція запрацювала, увімкніть Службу локації в Параметрах вашого iPhone в розділі Приватність.";
"Map.ForwardViaTelegram" = "Переслати через Telegram";
"Map.GetDirections" = "Отримати напрямки";
"Map.OpenInGoogleMaps" = "Відкрити в картах Google";

// Web
"Web.Error" = "Неможливо завантажити сторінку";
"Web.OpenExternal" = "Відкрити в Safari";
"Web.CopyLink" = "Скопіювати посилання";

// Document
"Document.TargetConfirmationFormat" = "Відправити файл  ({size}) {target}?";

// Dialog List
"DialogList.You" = "Ви";

// Settings
"Settings.TabTitle" = "Параметри";
"Settings.SetProfilePhoto" = "Встановити фотографію профілю";
"Settings.Logout" = "Вийти";
"Settings.Title" = "Параметри";
"Settings.NotificationsAndSounds" = "Сповіщення і звуки";
"Settings.ChatSettings" = "Параметри чату";
"Settings.BlockedUsers" = "Заблоковані користувачі";
"Settings.ChatBackground" = "Задній план чату";
"Settings.Support" = "Задати питання";
"Settings.FAQ" = "Telegram FAQ";
"Settings.FAQ_URL" = "http://telegram.org/faq#general";
"Settings.FAQ_Intro" = "Зверніть увагу, що підтримка Telegram здійснюється добровольцями. Ми постараємося відповісти якомога швидше, але на це може знадобитися деякий час. Будь ласка, ознайомтеся з часто вживаними питаннями про Telegram: там є важливі поради щодо усунення несправностей та відповіді на більшість питань.";
"Settings.FAQ_Button" = "FAQ";
"Settings.SaveIncomingPhotos" = "Зберігати вхідні фотографії";
"Settings.SaveIncomingPhotosHelp" = "Зберігати вхідні фотографії до Фотопотоку";
"Settings.LogoutError" = "Сталася помилка. Будь ласка, спробуйте знову пізніше.";

// Notifications and Sounds
"Notifications.Title" = "Сповіщення";
"Notifications.MessageNotifications" = "СПОВІЩЕННЯ ПРО ПОВІДОМЛЕННЯ";
"Notifications.MessageNotificationsAlert" = "Сигнал";
"Notifications.MessageNotificationsPreview" = "Попередній перегляд";
"Notifications.MessageNotificationsSound" = "Звук";
"Notifications.MessageNotificationsHelp" = "Ви можете встановити власні сповіщення для певних користувачів на їхній інформаційній сторінці.";

"Notifications.GroupNotifications" = "СПОВІЩЕННЯ ДЛЯ ГРУП";
"Notifications.GroupNotificationsAlert" = "Сигнал";
"Notifications.GroupNotificationsPreview" = "Попередній перегляд";
"Notifications.GroupNotificationsSound" = "Звук";
"Notifications.GroupNotificationsHelp" = "Ви можете встановити власні сповіщення для певних груп на інформаційній сторінці групи.";

"Notifications.TextTone" = "Звук повідомлення";
"Notifications.AlertTones" = "ЗВУКИ СПОВІЩЕННЯ";
"Notifications.ClassicTones" = "КЛАСИЧНІ";

"Notifications.InAppNotifications" = "СПОВІЩЕННЯ В ПРОГРАМІ";
"Notifications.InAppNotificationsSounds" = "Звуки";
"Notifications.InAppNotificationsVibrate" = "Вібрація";
"Notifications.InAppNotificationsPreview" = "Попередній перегляд";

"Notifications.Reset" = "Скинути";
"Notifications.ResetAllNotifications" = "Скинути всі сповіщення";
"Notifications.ResetAllNotificationsHelp" = "Скинути всі власні налаштування сповіщень для всіх контактів та груп.";

// Chat Settings
"ChatSettings.Title" = "Параметри чату";
"ChatSettings.Appearance" = "ЗОВНІШНІЙ ВИГЛЯД";
"ChatSettings.TextSize" = "Розмір тексту";
"ChatSettings.TextSizeUnits" = "пт";
"ChatSettings.AutomaticPhotoDownload" = "АВТОЗАВАНТАЖЕННЯ ФОТОГРАФІЙ";
"ChatSettings.AutomaticAudioDownload" = "АВТОЗАВАНТАЖЕННЯ АУДІО";
"ChatSettings.PrivateChats" = "В особистих чатах";
"ChatSettings.Groups" = "В групових чатах";
"ChatSettings.Security" = "БЕЗПЕКА";
"ChatSettings.Language" = "МОВА";
"ChatSettings.RevertLanguage" = "Повернути мову";
"ChatSettings.Cache" = "КЕШ";

// Usage
"Cache.Title" = "Параметри кешу";
"Cache.ClearCache" = "Очистити кеш";
"Cache.ClearCacheAlert" = "Фотографії, відео й інші файли з чатів, будуть вилучені з цього пристрою для заощадження дискового простору.\n\nВсі медіа залишаться в хмарному сховищі Telegram і можуть бути повторно завантажені за потреби.";
"Cache.KeepMedia" = "Зберігати медіа";
"Cache.Help" = "Фото, відео та інші файли з чатів можуть бути видалені з цього пристрою при встановленні обмеження на зберігання з метою економії вільного місця.\n\nВсі файли залишаться в хмарі Telegram і можуть бути повторно завантажені, якщо знадобиться.";

// Blocked Users
"BlockedUsers.Title" = "Заблоковані";
"BlockedUsers.SelectUserTitle" = "Заблокувати користувача";
"BlockedUsers.AlreadyBlocked" = "Цей користувач уже заблокований";
"BlockedUsers.BlockUser" = "Заблокувати користувача";
"BlockedUsers.BlockFormat" = "Заблокувати %@?";
"BlockedUsers.BlockTitle" = "Заблокувати";
"BlockedUsers.LeavePrefix" = "Покинути";
"BlockedUsers.Info" = "Заблоковані користувачі не можуть посилати вам повідомлення або додаватися в ваші групи. Вони не бачать фото вашого профілю і ваш статус.";
"BlockedUsers.AddNew" = "Додати...";
"BlockedUsers.Unblock" = "Розблокувати";

// Wallpaper
"Wallpaper.Title" = "Задній план чату";
"Wallpaper.PhotoLibrary" = "Бібліотека";
"Wallpaper.Set" = "Встановити";
"Wallpaper.Wallpaper" = "Заставки";

// Update
"Update.Update" = "Оновити";

// Service
"Service.LocalizationDownloadError" = "Не вдається завантажити файл локалізації. Будь ласка, перевірте ваше інтернет з'єднання та спробуйте знову.";
"Service.ApplyLocalization" = "Застосувати локалізацію?";
"Service.ApplyLocalizationWithWarnings" = "%@\n\nЗастосувати локалізацію?";

"Notification.SecretChatMessageScreenshot" = "%@ зробив/ла скріншот";
"Notification.SecretChatScreenshot" = "Скріншот зроблений";

// Broadcast Lists
"DialogList.Broadcast" = "Трансляція";
"BroadcastLists.Title" = "Списки трансляції";
"BroadcastLists.NoListsYet" = "Ще немає списків";
"BroadcastLists.NoListsText" = "За допомогою списків трансляції ви можете за раз відправити однакові повідомлення багатьом людям.";

// Broadcast List
"BroadcastListInfo.Title" = "Список трансляції";
"BroadcastListInfo.AddRecipient" = "Добавити одержувача";

// Video
"VideoPreview.OptionSD" = "Звичайний розмір (%@)";
"VideoPreview.OptionHD" = "Висока роздільна здатність (%@)";

"ChatSettings.AutoPlayAudio" = "Автозапуск аудіо";

"Settings.LogoutConfirmationTitle" = "Вийти";
"Settings.LogoutConfirmationText" = "\nВи можете безперешкодно користуватися Telegram на всіх своїх пристроях одночасно.\n\nМайте на увазі, що завершення сесії знищить всі ваші секретні чати.";

"Login.PadPhoneHelp" = "\nДля входу в Telegram на будь-якому своєму пристрої ви можете використовувати ваш основний номер телефону. Номер SIM-карти iPad не підійде, оскільки нам необхідно відправити вам SMS-повідомлення.\n\nЦей номер правильно вказаний?\n{number}";
"Login.PadPhoneHelpTitle" = "Ваш номер";

"MessageTimer.Custom" = "Вибір";
"MessageTimer.Title" = "Встановлення таймера";

"MessageTimer.Forever" = "Постійно";

"MessageTimer.Seconds_1" = "%@ сек.";
"MessageTimer.Seconds_2" = "%@ сек.";
"MessageTimer.Seconds_3_10" = "%@ сек.";
"MessageTimer.Seconds_any" = "%@ сек.";
"MessageTimer.Minutes_1" = "%@ хв.";
"MessageTimer.Minutes_2" = "%@ хв.";
"MessageTimer.Minutes_3_10" = "%@ хв.";
"MessageTimer.Minutes_any" = "%@ хв.";
"MessageTimer.Hours_1" = "%@ год.";
"MessageTimer.Hours_2" = "%@ год.";
"MessageTimer.Hours_3_10" = "%@ год.";
"MessageTimer.Hours_any" = "%@ год.";
"MessageTimer.Days_1" = "%@ дн.";
"MessageTimer.Days_2" = "%@ дн.";
"MessageTimer.Days_3_10" = "%@ дн.";
"MessageTimer.Days_any" = "%@ дн.";
"MessageTimer.Weeks_1" = "%@ тиж.";
"MessageTimer.Weeks_2" = "%@ тиж.";
"MessageTimer.Weeks_3_10" = "%@ тиж.";
"MessageTimer.Weeks_any" = "%@ тиж.";
"MessageTimer.Months_1" = "%@ міс.";
"MessageTimer.Months_2" = "%@ міс.";
"MessageTimer.Months_3_10" = "%@ міс.";
"MessageTimer.Months_any" = "%@ міс.";
"MessageTimer.Years_1" = "%@ р.";
"MessageTimer.Years_2" = "%@ р.";
"MessageTimer.Years_3_10" = "%@ р.";
"MessageTimer.Years_any" = "%@ р.";

"MessageTimer.ShortSeconds_1" = "%@с";
"MessageTimer.ShortSeconds_2" = "%@с";
"MessageTimer.ShortSeconds_3_10" = "%@с";
"MessageTimer.ShortSeconds_any" = "%@с";
"MessageTimer.ShortMinutes_1" = "%@м";
"MessageTimer.ShortMinutes_2" = "%@м";
"MessageTimer.ShortMinutes_3_10" = "%@м";
"MessageTimer.ShortMinutes_any" = "%@м";
"MessageTimer.ShortHours_1" = "%@г";
"MessageTimer.ShortHours_2" = "%@г";
"MessageTimer.ShortHours_3_10" = "%@г";
"MessageTimer.ShortHours_any" = "%@г";
"MessageTimer.ShortDays_1" = "%@д";
"MessageTimer.ShortDays_2" = "%@д";
"MessageTimer.ShortDays_3_10" = "%@д";
"MessageTimer.ShortDays_any" = "%@д";
"MessageTimer.ShortWeeks_1" = "%@т";
"MessageTimer.ShortWeeks_2" = "%@т";
"MessageTimer.ShortWeeks_3_10" = "%@т";
"MessageTimer.ShortWeeks_any" = "%@т";

"Activity.UploadingPhoto" = "відправлення фото";
"Activity.UploadingVideo" = "відправлення відео";
"Activity.UploadingDocument" = "відправлення файла";
"Activity.RecordingAudio" = "запис аудіо";
"Activity.Location" = "визначення місцерозташування";

"Service.NetworkConfigurationUpdatedMessage" = "Параметри з'єднання успішно оновлено.";

"Compatibility.SecretMediaVersionTooLow" = "%@ використовує стару версію Telegram через що секретні фото будуть відображатися в режимі сумісності.\n\nПісля того, як %@ оновить Telegram, фото з таймером на 1 хвилину і менше будуть відображатися в режимі «Для перегляду натиснути та утримувати». Ви будете повідомлені, коли інша сторона приймає картинку.";

"Contacts.GlobalSearch" = "Глобальний пошук";
"Profile.Username" = "ім'я користувача";
"Settings.Username" = "Ім'я користувача";
"Settings.UsernameEmpty" = "Немає";

"Username.Title" = "Ім'я кристувача";
"Username.Placeholder" = "Ваше ім'я";
"Username.Help" = "В **Telegram** можна вибрати ім'я користувача, після чого інші люди зможуть знайти вас по ньому і зв'язатися з вами навіть, не знаючи вашого телефонного номера.\n\n**a-z**, **0-9** і підкреслення. Мінімальна довжина — **5** символів.";
"Username.InvalidTooShort" = "Ім'я користувача має складатися мінімум з 5 символів.";
"Username.InvalidStartsWithNumber" = "Вибачте, ім'я користувача не повинно починатися з цифри.";
"Username.InvalidCharacters" = "Вибачте, вибране ім'я некоректне.";
"Username.InvalidTaken" = "Вибачте, на жаль, це ім'я вже зайнято.";

"Username.CheckingUsername" = "Перевірка імені...";
"Username.UsernameIsAvailable" = "Ім'я %@ доступне. ";

"WebSearch.Images" = "Зображення";
"WebSearch.GIFs" = "GIF-зображення";
"WebSearch.RecentSectionTitle" = "Недавні";
"WebSearch.RecentSectionClear" = "Очистити";

"Settings.PrivacySettings" = "Приватність і безпека";

"UserCount_1" = "1 користувач";
"UserCount_2" = "2 користувачів";
"UserCount_3_10" = "Користувачів: %@";
"UserCount_any" = "Користувачів: %@";

"PrivacySettings.Title" = "Приватність і Безпека";

"PrivacySettings.PrivacyTitle" = "ПРИВАТНІСТЬ";
"PrivacySettings.LastSeen" = "був/ла в мережі";
"PrivacySettings.LastSeenEverybody" = "Всі";
"PrivacySettings.LastSeenContacts" = "Мої контакти";
"PrivacySettings.LastSeenNobody" = "Ніхто";

"PrivacySettings.LastSeenEverybodyMinus" = "Всі (-%@)";
"PrivacySettings.LastSeenContactsPlus" = "Мої контакти (+%@)";
"PrivacySettings.LastSeenContactsMinus" = "Мої контакти (-%@)";
"PrivacySettings.LastSeenContactsMinusPlus" = "Мої контакти (-%@, +%@)";
"PrivacySettings.LastSeenNobodyPlus" = "Ніхто (+%@)";

"PrivacySettings.SecurityTitle" = "БЕЗПЕКА";

"PrivacySettings.DeleteAccountTitle" = "ВИДАЛИТИ МІЙ ОБЛІКОВИЙ ЗАПИС";
"PrivacySettings.DeleteAccountIfAwayFor" = "Якщо вас не було";
"PrivacySettings.DeleteAccountHelp" = "Якщо ви не входите принаймні раз протягом цього періоду, ваш обліковий запис буде видалений разом з усіма групами, повідомленнями та контактами.";
"PrivacySettings.DeleteAccountNowConfirmation" = "Видалити обліковий запис?";
"PrivacySettings.DeleteAccountNever" = "Ніколи";

"PrivacyLastSeenSettings.Title" = "був/ла в мережі";
"PrivacyLastSeenSettings.CustomHelp" = "Важливо: ви не зможете побачити час останньої активності людей, з якими ви не поділилися своїм часом останньої активності. Замість цього буде відображатися приблизний час (недавно, протягом тижня, протягом місяця).";
"PrivacyLastSeenSettings.AlwaysShareWith" = "Завжди ділитися з";
"PrivacyLastSeenSettings.NeverShareWith" = "Ніколи не ділитися з";
"PrivacyLastSeenSettings.CustomShareSettingsHelp" = "Ці параметри перезапишуть значення вгорі.";

"PrivacyLastSeenSettings.CustomShareSettings.Delete" = "Видалити";
"PrivacyLastSeenSettings.AlwaysShareWith.Title" = "Завжди ділитися";
"PrivacyLastSeenSettings.AlwaysShareWith.Placeholder" = "Завжди ділитися з...";
"PrivacyLastSeenSettings.NeverShareWith.Title" = "Ніколи не ділитись";
"PrivacyLastSeenSettings.NeverShareWith.Placeholder" = "Ніколи не ділитись з...";
"PrivacyLastSeenSettings.EmpryUsersPlaceholder" = "Додати користувача";
"PrivacyLastSeenSettings.AddUsers_1" = "Додати одного користувача в цей список?";
"PrivacyLastSeenSettings.AddUsers_2" = "Додати двох користувачів в цей список?";
"PrivacyLastSeenSettings.AddUsers_3_10" = "Додати %@ користувачів в цей список?";
"PrivacyLastSeenSettings.AddUsers_any" = "Додати %@ користувачів в цей список?";

"PrivacySettings.FloodControlError" = "Вибачте, занадто багато запитів. Зараз неможливо змінити параметри приватності, будь ласка, зачекайте.";


"ImagePicker.NoPhotos" = "Фотографії відсутні";
"ImagePicker.NoVideos" = "Відеозаписи відсутні";

"Settings.OpenSystemPrivacySettings" = "Відкрити Параметри %@";

// Photo Editor
"PhotoEditor.DiscardChanges" = "Відхилити зміни";
"PhotoEditor.RevertToOriginal" = "Повернути оригінал";
"PhotoEditor.RevertMessage" = "Повернення оригіналу прибере всі зміни, зроблені в цій фотографії. Цю дію неможливо відмінити.";

"PhotoEditor.Original" = "Оригінал";
"PhotoEditor.Current" = "Поточний";

"PhotoEditor.CropReset" = "СКИНУТИ";
"PhotoEditor.CropAuto" = "АВТО";
"PhotoEditor.CropAspectRatioOriginal" = "Оригінал";
"PhotoEditor.CropAspectRatioSquare" = "Квадрат";

"PhotoEditor.EnhanceTool" = "Покращити";
"PhotoEditor.ExposureTool" = "Експозиція";
"PhotoEditor.ContrastTool" = "Контраст";
"PhotoEditor.WarmthTool" = "Тепло";
"PhotoEditor.SaturationTool" = "Насиченість";
"PhotoEditor.HighlightsTool" = "Яскравість";
"PhotoEditor.ShadowsTool" = "Тіні";
"PhotoEditor.VignetteTool" = "Віньєтка";
"PhotoEditor.GrainTool" = "Зернистість";
"PhotoEditor.BlurTool" = "Розмитість";
"PhotoEditor.SharpenTool" = "Різкість";

"PhotoEditor.BlurToolOff" = "Вимк";
"PhotoEditor.BlurToolRadial" = "Радіальний";
"PhotoEditor.BlurToolLinear" = "Лінійний";

"PhotoEditor.Set" = "Встановити";
"PhotoEditor.Skip" = "Пропустити";

// Camera
"Camera.PhotoMode" = "ФОТО";
"Camera.VideoMode" = "ВІДЕО";
"Camera.SquareMode" = "КВАДРАТ";
"Camera.FlashOff" = "Вимк";
"Camera.FlashOn" = "Увімк";
"Camera.FlashAuto" = "Авто";
"Camera.Retake" = "Ще раз";

"Settings.PhoneNumber" = "Ваш номер";

"PhoneNumberHelp.Help" = "Тут ви можете змінити ваш номер Telegram. Ваш обліковий запис разом з усіма даними (повідомлення, медіа, контакти та ін.) буде перенесено на новий номер.\n\n**Важливо:** всім вашим контактам Telegram ваш **новий номер** буде автоматично доданий в адресну книгу, за умови, що в них був ваш старий номер і ви не блокували їх в Telegram.";
"PhoneNumberHelp.Alert" = "Всім вашим контактам Telegram ваш новий номер буде автоматично доданий в адресну книгу, за умови, що у них був ваш старий номер і ви не блокували їх в Telegram.";
"PhoneNumberHelp.ChangeNumber" = "Змінити номер";

"ChangePhoneNumberNumber.Title" = "Змінити номер";
"ChangePhoneNumberNumber.NewNumber" = "Новий номер";
"ChangePhoneNumberNumber.Help" = "Ми відправимо СМС з кодом підтвердження на ваш новий номер.";
"ChangePhoneNumberNumber.NumberPlaceholder" = "Введіть ваш новий номер";

"ChangePhoneNumberCode.Code" = "ВАШ КОД";
"ChangePhoneNumberCode.CodePlaceholder" = "Код";
"ChangePhoneNumberCode.Help" = "Ми вислали вам СМС з кодом";
"ChangePhoneNumberCode.CallTimer" = "Telegram передзвонить вам через %@";
"ChangePhoneNumberCode.RequestingACall" = "Запит дзвінка від Telegram...";
"ChangePhoneNumberCode.Called" = "Telegram набирає ваш номер";

"LoginPassword.Title" = "Ваш пароль";
"LoginPassword.PasswordPlaceholder" = "Пароль";
"LoginPassword.InvalidPasswordError" = "Неправильний пароль. Спробуйте знову.";
"LoginPassword.FloodError" = "Ліміт вичерпано. Спробуйте знову пізніше.";
"LoginPassword.ForgotPassword" = "Забули пароль?";
"LoginPassword.PasswordHelp" = "Двоетапну перевірку увімкнено. Ваш обліковий запис захищено додатковим паролем.";
"LoginPassword.ResetAccount" = "Скинути обліковий запис";

"QuickSend.Photos_1" = "Надіслати 1 фотографію";
"QuickSend.Photos_2" = "Надіслати 2 фотографії";
"QuickSend.Photos_3_10" = "Надіслати %@ фотографії/й";
"QuickSend.Photos_any" = "Надіслати %@ фотографії/й";

"Share.Title" = "Поділитися";
"Forward.ConfirmMultipleFiles_1" = "Надіслати 1 файл до {target}?";
"Forward.ConfirmMultipleFiles_2" = "Надіслати 2 файли до {target}?";
"Forward.ConfirmMultipleFiles_3_10" = "Надіслати %@ файлів до {target}?";
"Forward.ConfirmMultipleFiles_any" = "Надіслати %@ файлів до {target}?";

"PrivacySettings.TouchIdTitle" = "Touch ID";
"PrivacySettings.TouchIdEnable" = "Увімкнути";

"Notification.Reply" = "Відповісти";
"Notification.Mute1h" = "Вимкнути на 1 годину";
"Notification.Mute1hMin" = "Вимкнути на 1г";
"Conversation.ContextMenuShare" = "Поділитися";

"SharedMedia.TitleAll" = "Спільні медіа";
"SharedMedia.TitlePhoto" = "Спільні фотографії";
"SharedMedia.TitleVideo" = "Спільні відео";
"SharedMedia.TitleFile" = "Спільні файли";
"SharedMedia.TitleAudio" = "Спільна музика";

"SharedMedia.All" = "Все";
"SharedMedia.Incoming" = "Отримано";
"SharedMedia.Outgoing" = "Надіслано";

"SharedMedia.Photo_1" = "1 фотографія";
"SharedMedia.Photo_2" = "2 фотографії";
"SharedMedia.Photo_3_10" = "%@ фотографій";
"SharedMedia.Photo_any" = "%@ фотографій";

"SharedMedia.Video_1" = "1 відео";
"SharedMedia.Video_2" = "2 відео";
"SharedMedia.Video_3_10" = "%@ відео";
"SharedMedia.Video_any" = "%@ відео";

"SharedMedia.File_1" = "1 файл";
"SharedMedia.File_2" = "2 файли";
"SharedMedia.File_3_10" = "%@ файлів";
"SharedMedia.File_any" = "%@ файлів";

"SharedMedia.Generic_1" = "1 файл медіа";
"SharedMedia.Generic_2" = "2 файли медіа";
"SharedMedia.Generic_3_10" = "%@ файлів медіа";
"SharedMedia.Generic_any" = "%@ файлів медіа";

"FileSize.B" = "%@ Б";
"FileSize.KB" = "%@ КБ";
"FileSize.MB" = "%@ МБ";
"FileSize.GB" = "%@ ГБ";

"DownloadingStatus" = "Завантаження %@ із %@";

"Time.MonthOfYear_1" = "%@ січня";
"Time.MonthOfYear_2" = "%@ лютого";
"Time.MonthOfYear_3" = "%@ березня";
"Time.MonthOfYear_4" = "%@ квітня";
"Time.MonthOfYear_5" = "%@ травня";
"Time.MonthOfYear_6" = "%@ червня";
"Time.MonthOfYear_7" = "%@ липня";
"Time.MonthOfYear_8" = "%@ серпня";
"Time.MonthOfYear_9" = "%@ вересня";
"Time.MonthOfYear_10" = "%@ жовтня";
"Time.MonthOfYear_11" = "%@ листопада";
"Time.MonthOfYear_12" = "%@ грудня";

"Time.PreciseDate_1" = "%1$@ січ, %2$@, %3$@";
"Time.PreciseDate_2" = "%1$@ лют, %2$@, %3$@";
"Time.PreciseDate_3" = "%1$@ бер, %2$@, %3$@";
"Time.PreciseDate_4" = "%1$@ кві, %2$@, %3$@";
"Time.PreciseDate_5" = "%1$@ тра, %2$@, %3$@";
"Time.PreciseDate_6" = "%1$@ чер, %2$@, %3$@";
"Time.PreciseDate_7" = "%1$@ лип, %2$@, %3$@";
"Time.PreciseDate_8" = "%1$@ сер, %2$@, %3$@";
"Time.PreciseDate_9" = "%1$@ вер, %2$@, %3$@";
"Time.PreciseDate_10" = "%1$@ жов, %2$@, %3$@";
"Time.PreciseDate_11" = "%1$@ лис, %2$@, %3$@";
"Time.PreciseDate_12" = "%1$@ гру, %2$@, %3$@";

"MuteFor.Minutes_1" = "Вимкнути на 1 хвилину";
"MuteFor.Minutes_2" = "Вимкнути на 2 хвилини";
"MuteFor.Minutes_3_10" = "Вимкнути на %@ хвилини";
"MuteFor.Minutes_any" = "Вимкнути на %@ хвилин";

"MuteFor.Hours_1" = "Вимкнути на 1 годину";
"MuteFor.Hours_2" = "Вимкнути на 2 години";
"MuteFor.Hours_3_10" = "Вимкнути на %@ години";
"MuteFor.Hours_any" = "Вимкнути на %@ годин";

"MuteFor.Days_1" = "Вимкнути на 1 день";
"MuteFor.Days_2" = "Вимкнути на 2 дні";
"MuteFor.Days_3_10" = "Вимкнути на %@ дні";
"MuteFor.Days_any" = "Вимкнути на %@ днів";

"MuteFor.Weeks_1" = "Вимкнути на 1 тиждень";
"MuteFor.Weeks_2" = "Вимкнути на 2 тижні";
"MuteFor.Weeks_3_10" = "Вимкнути на %@ тижні";
"MuteFor.Weeks_any" = "Вимкнути на %@ тижнів";

"MuteExpires.Minutes_1" = "через 1 хвилину";
"MuteExpires.Minutes_2" = "через 2 хвилини";
"MuteExpires.Minutes_3_10" = "через %@ хвилини";
"MuteExpires.Minutes_any" = "через %@ хвилин";

"MuteExpires.Hours_1" = "через 1 годину";
"MuteExpires.Hours_2" = "через 2 години";
"MuteExpires.Hours_3_10" = "через %@ години";
"MuteExpires.Hours_any" = "через %@ годин";

"MuteExpires.Days_1" = "через 1 день";
"MuteExpires.Days_2" = "через 2 дні";
"MuteExpires.Days_3_10" = "через %@ дні";
"MuteExpires.Days_any" = "через %@ днів";

"SharedMedia.EmptyTitle" = "Наразі немає файлів медіа";
"SharedMedia.EmptyText" = "Діліться фотографіями й відео в цьому чаті\n— інакше скріпка залишиться незадоволеною.";
"SharedMedia.EmptyFilesText" = "Ви можете надсилати й отримувати\nфайли будь-якого типу до 1.5 ГБ кожний\nта отримувати до них доступ звідусіль.";

"ShareFileTip.Title" = "Поширення файлів";
"ShareFileTip.Text" = "Ви можете ділитися **не стиснутими** файлами медіа зі своєї камери тут.\n\nЩоб поділитися файлами будь-якого іншого типу, відкрийте їх в %@ (наприклад в своєму браузері), торкніться **Відкрити в...** або виберіть Telegram за допомогою кнопки дії.";
"ShareFileTip.CloseTip" = "Закрити підказку";

"DialogList.SearchSectionDialogs" = "Чати й контакти";
"DialogList.SearchSectionGlobal" = "Глобальний пошук";
"DialogList.SearchSectionMessages" = "Повідомлення";

"Username.LinkHint" = "Це посилання відкриває з вами чат в Telegram:[\nhttps://telegram.me/%@]";
"Username.LinkCopied" = "Посилання скопійовано до буферу";

"SharedMedia.ItemsSelected_1" = "Обрано 1";
"SharedMedia.ItemsSelected_2" = "Обрано 2";
"SharedMedia.ItemsSelected_3_10" = "Обрано %@";
"SharedMedia.ItemsSelected_any" = "Обрано %@";

"SharedMedia.DeleteItemsConfirmation_1" = "Видалити файл медіа?";
"SharedMedia.DeleteItemsConfirmation_2" = "Видалити 2 файли медіа?";
"SharedMedia.DeleteItemsConfirmation_3_10" = "Видалити %@ файли медіа?";
"SharedMedia.DeleteItemsConfirmation_any" = "Видалити %@ файлів медіа?";

"PrivacySettings.Passcode" = "Заблоковано кодом допуску";
"PasscodeSettings.Title" = "Заблоковано кодом допуску";
"PasscodeSettings.TurnPasscodeOn" = "Увімкнути код допуску";
"PasscodeSettings.TurnPasscodeOff" = "Вимкнути код допуску";
"PasscodeSettings.ChangePasscode" = "Змінити код допуску";
"PasscodeSettings.Help" = "Коли ви встановите додатковий код допуску, на сторінці чату з'явиться піктограма блокування. Торкніться її для блокування й розблокування програми.\n\nПримітка: якщо ви забудете код допуску, вам доведеться видалити й повторно встановити програму. Всі секретні чати будуть втрачені.";
"PasscodeSettings.UnlockWithTouchId" = "Розблокування з Touch ID";
"PasscodeSettings.SimplePasscode" = "Простий код допуску";
"PasscodeSettings.SimplePasscodeHelp" = "Простий код допуску містить 4 цифри.";
"PasscodeSettings.EncryptData" = "Зашифрувати локальну базу даних";
"PasscodeSettings.EncryptDataHelp" = "Експериментальна функція, використовуйте з обережністю. Зашифрувати свої локальні дані Telegram, використовуючи в якості ключа похідну від вашого коду допуску.";

"EnterPasscode.EnterTitle" = "Введіть свій код допуску Telegram";
"EnterPasscode.SetupTitle" = "Новий код допуску";
"EnterPasscode.ChangeTitle" = "Змінити код допуску";
"EnterPasscode.EnterPasscode" = "Введіть свій код допуску Telegram";
"EnterPasscode.EnterNewPasscodeNew" = "Введіть код допуску";
"EnterPasscode.EnterNewPasscodeChange" = "Введіть новий код допуску";
"EnterPasscode.RepeatNewPasscode" = "Введіть новий код допуску ще раз";
"EnterPasscode.EnterCurrentPasscode" = "Введіть поточний код допуску";
"EnterPasscode.TouchId" = "Введіть свій код допуску";

"DialogList.PasscodeLockHelp" = "Торкніться для блокування Telegram";

"PasscodeSettings.AutoLock" = "Автоблокування";
"PasscodeSettings.AutoLock.Disabled" = "Вимкнено";
"PasscodeSettings.AutoLock.IfAwayFor_1minute" = "Відсутність 1 хв";
"PasscodeSettings.AutoLock.IfAwayFor_5minutes" = "Відсутність 5 хв";
"PasscodeSettings.AutoLock.IfAwayFor_1hour" = "Відсутність 1 год";
"PasscodeSettings.AutoLock.IfAwayFor_5hours" = "Відсутність 5 год";

"PasscodeSettings.FailedAttempts_1" = "1 невдала спроба";
"PasscodeSettings.FailedAttempts_2" = "2 невдалі спроби";
"PasscodeSettings.FailedAttempts_3_10" = "%@ невдалі спроби";
"PasscodeSettings.FailedAttempts_any" = "%@ невдалих спроб";
"PasscodeSettings.TryAgainIn1Minute" = "Спробуйте знову через 1 хвилину";

"AccessDenied.Title" = "Будь ласка, дайте доступ";

"AccessDenied.Contacts" = "Спілкування в Telegram базується на списку ваших контактів.\n\nПерейдіть в Параметри — Приватність — Контакти та увімкніть перемикач для Telegram.";

"AccessDenied.VoiceMicrophone" = "Telegram потрібен доступ до вашого мікрофона для надсилання голосових повідомлень.\n\nБудь ласка, перейдіть в Параметри > Приватність > Мікрофон і увімкніть для Telegram.";

"AccessDenied.VideoMicrophone" = "Telegram потрібен доступ до вашого мікрофона для запису звуку відео.\n\nБудь ласка, перейдіть в Параметри > Приватність > Мікрофон і увімкніть для Telegram.";

"AccessDenied.MicrophoneRestricted" = "Доступ до мікрофону обмежений для Telegram.\n\nБудь ласка, перейдіть в Параметри > Загальні > Обмеження > Мікрофон і увімкніть для Telegram.";


"AccessDenied.Camera" = "Telegram потрібен доступ до вашої камери для зйомки фото і відео.\n\nБудь ласка, перейдіть в Параметри > Приватність > Камера і увімкніть для Telegram.";

"AccessDenied.CameraRestricted" = "Доступ до камери обмежений для Telegram.\n\nБудь ласка, перейдіть в Параметри > Загальні > Обмеження > Камера і увімкніть для Telegram.";

"AccessDenied.CameraDisabled" = "Доступ до камери обмежений на глобальному рівні на вашому телефоні.\n\nБудь ласка, перейдіть в Параметри > Загальні > Обмеження і увімкніть для Камери.";

"AccessDenied.PhotosAndVideos" = "Telegram потрібен доступ до вашої галереї фотографій для надсилання фото і відео.\n\nБудь ласка, перейдіть в Параметри > Приватність > Фотографії та увімкніть для Telegram.";

"AccessDenied.SaveMedia" = "Telegram потрібен доступ до вашої галереї фотографій для збереження фото і відео.\n\nБудь ласка, перейдіть в Параметри > Приватність > Фотографії та увімкніть для Telegram.";

"AccessDenied.PhotosRestricted" = "Доступ до фотографій обмежений для Telegram.\n\nБудь ласка, перейдіть в Параметри > Загальні > Обмеження > Фотографії та увімкніть для Telegram.";

"AccessDenied.LocationDenied" = "Telegram потрібен доступ до вашого розташування, щоб ви могли ділитися ним зі своїми контактами.\n\nБудь ласка, перейдіть в Параметри > Приватність > Служба локації та увімкніть для Telegram.";

"AccessDenied.LocationDisabled" = "Telegram потрібен доступ до вашого розташування, щоб ви могли ділитися ним зі своїми контактами.\n\nБудь ласка, перейдіть в Параметри > Приватність > Служба локації та увімкніть її.";

"AccessDenied.LocationTracking" = "Telegram потрібен доступ до вашого розташування, щоб показувати вас на карті.\n\nБудь ласка, перейдіть в Параметри > Приватність > Служба локації та увімкніть її.";

"AccessDenied.Settings" = "Параметри";

"WebSearch.RecentClearConfirmation" = "Ви впевнені, що хочете видалити останні зображення?";

"FeatureDisabled.Oops" = "Ой";

"Conversation.ContextMenuReply" = "Відповісти";

"ForwardedMessages_1" = "Переслане повідомлення";
"ForwardedMessages_2" = "2 переслані повідомлення";
"ForwardedMessages_3_10" = "%@ переслані повідомлення";
"ForwardedMessages_any" = "%@ пересланих повідомлень";

"ForwardedFiles_1" = "Пересланий файл";
"ForwardedFiles_2" = "2 переслані файли";
"ForwardedFiles_3_10" = "%@ переслані файли";
"ForwardedFiles_any" = "%@ пересланих файлів";

"ForwardedStickers_1" = "Переслана наліпка";
"ForwardedStickers_2" = "2 переслані наліпки";
"ForwardedStickers_3_10" = "%@ переслані наліпки";
"ForwardedStickers_any" = "%@ пересланих наліпок";

"ForwardedPhotos_1" = "Переслане фото";
"ForwardedPhotos_2" = "2 переслані фотографії";
"ForwardedPhotos_3_10" = "%@ переслані фотографії";
"ForwardedPhotos_any" = "%@ пересланих фотографій";

"ForwardedVideos_1" = "Переслане відео";
"ForwardedVideos_2" = "2 переслані відео";
"ForwardedVideos_3_10" = "%@ переслані відео";
"ForwardedVideos_any" = "%@ пересланих відео";

"ForwardedAudios_1" = "Переслане аудіо";
"ForwardedAudios_2" = "2 переслані аудіо";
"ForwardedAudios_3_10" = "%@ переслані аудіо";
"ForwardedAudios_any" = "%@ пересланих аудіо";

"ForwardedLocations_1" = "Переслане розташування";
"ForwardedLocations_2" = "2 переслані розташування";
"ForwardedLocations_3_10" = "%@ переслані розташування";
"ForwardedLocations_any" = "%@ пересланих розташувань";

"ForwardedGifs_1" = "Пересланий GIF";
"ForwardedGifs_2" = "2 переслані GIF";
"ForwardedGifs_3_10" = "%@ переслані GIF";
"ForwardedGifs_any" = "%@ пересланих GIF";

"ForwardedContacts_1" = "Пересланий контакт";
"ForwardedContacts_2" = "2 переслані контакти";
"ForwardedContacts_3_10" = "%@ переслані контакти";
"ForwardedContacts_any" = "%@ пересланих контактів";

"ForwardedAuthors2" = "%@, %@";
"ForwardedAuthorsOthers_1" = "%@ та 1 інший";
"ForwardedAuthorsOthers_2" = "%@ та 2 інші";
"ForwardedAuthorsOthers_3_10" = "%@ та %@ інші";
"ForwardedAuthorsOthers_any" = "%@ та %@ інших";

"PrivacySettings.TwoStepAuth" = "Двоетапна перевірка";
"TwoStepAuth.Title" = "Двоетапна перевірка";
"TwoStepAuth.SetPassword" = "Встановити додатковий пароль";
"TwoStepAuth.SetPasswordHelp" = "Ви можете встановити пароль, який буде запитуватись при вході з нового пристрою додатково до коду, отриманого в SMS.";
"TwoStepAuth.SetupPasswordTitle" = "Ваш пароль";

"TwoStepAuth.SetupHintTitle" = "Натяк пароля";
"TwoStepAuth.SetupHint" = "Створіть підказку для свого паролю:";

"TwoStepAuth.ChangePassword" = "Змінити пароль";
"TwoStepAuth.RemovePassword" = "Вимкнути пароль";
"TwoStepAuth.SetupEmail" = "Електронна пошта для відновлення";
"TwoStepAuth.ChangeEmail" = "Змінити електронну пошту для відновлення";
"TwoStepAuth.PendingEmailHelp" = "Ваша е-пошта %@ ще не активна й очікує підтвердження.";
"TwoStepAuth.GenericHelp" = "Ви увімкнули двоетапну перевірку.\nВам знадобиться встановлений тут пароль для входу в свій обліковий запис Telegram.";

"TwoStepAuth.ConfirmationTitle" = "Двоетапна перевірка";
"TwoStepAuth.ConfirmationText" = "Будь ласка, перевірте свою е-пошту та натисніть на посилання для підтвердження, щоб завершити встановлення двоетапної перевірки. Також перевірте теку спаму.";
"TwoStepAuth.ConfirmationChangeEmail" = "Змінити е-пошту";
"TwoStepAuth.ConfirmationAbort" = "Перервати встановлення двоетапної перевірки";

"TwoStepAuth.SetupPasswordEnterPasswordNew" = "Введіть пароль:";
"TwoStepAuth.SetupPasswordEnterPasswordChange" = "Введіть новий пароль:";
"TwoStepAuth.SetupPasswordConfirmPassword" = "Введіть новий пароль повторно:";
"TwoStepAuth.SetupPasswordConfirmFailed" = "Паролі не збігаються. Спробуйте знову.";

"TwoStepAuth.EnterPasswordTitle" = "Пароль";
"TwoStepAuth.EnterPasswordPassword" = "Пароль";
"TwoStepAuth.EnterPasswordHint" = "Підказка: %@";
"TwoStepAuth.EnterPasswordHelp" = "Ви увімкнули двоетапну перевірку, отже ваш обліковий запис захищений додатковим паролем.";
"TwoStepAuth.EnterPasswordInvalid" = "Неправильний пароль. Спробуйте знову.";
"TwoStepAuth.EnterPasswordForgot" = "Забули пароль?";

"TwoStepAuth.EmailTitle" = "Електронна пошта для відновлення";
"TwoStepAuth.EmailSkip" = "Пропустити";
"TwoStepAuth.EmailSkipAlert" = "Ні, серйозно.\n\nЯкщо ви забудете свій пароль, ви втратите доступ до облікового запису Telegram. Не буде можливості відновити його.";
"TwoStepAuth.Email" = "Е-пошта";
"TwoStepAuth.EmailPlaceholder" = "Ваша адреса електронної пошти";
"TwoStepAuth.EmailHelp" = "Будь ласка, додайте свою дійсну адресу електронної пошти. Це єдиний спосіб відновити забутий пароль.";
"TwoStepAuth.EmailInvalid" = "Недійсна адреса е-пошти. Спробуйте знову.";
"TwoStepAuth.EmailSent" = "Ми надіслали вам електронний лист для підтвердження адреси.";
"TwoStepAuth.PasswordSet" = "Ваш пароль для двоетапної перевірки тепер активовано.";
"TwoStepAuth.PasswordRemoveConfirmation" = "Ви дійсно хочете вимкнути пароль?";

"TwoStepAuth.RecoveryUnavailable" = "Оскільки при створенні пароля ви не вказали адресу електронної пошти для відновлення, то вам залишилось або згадати свій пароль, або скинути обліковий запис.";
"TwoStepAuth.RecoveryFailed" = "У вас залишилась можливість згадати свій пароль або відновити обліковий запис.";
"TwoStepAuth.ResetAccount" = "Відновити обліковий запис";
"TwoStepAuth.ResetAccountHelp" = "Якщо ви продовжите відновлення облікового запису, ви втратите всі свої чати й повідомлення разом з будь-якими поширеними медіа й файлами.";
"TwoStepAuth.ResetAccountConfirmation" = "При відновленні облікового запису, ви втратите всі свої чати й повідомлення, разом з будь-якими спільними медіа й файлами.";

"TwoStepAuth.RecoveryTitle" = "Надіслати код на е-пошту";
"TwoStepAuth.RecoverySent" = "Ми надіслали код відновлення на вказану вами е-пошту:\n\n%@";
"TwoStepAuth.RecoveryCode" = "Код";
"TwoStepAuth.RecoveryCodeHelp" = "Для деактивації паролю, перевірте свою електронну пошту та введіть надісланий 6-значний код.";
"TwoStepAuth.RecoveryCodeInvalid" = "Недійсний код. Спробуйте знову.";
"TwoStepAuth.RecoveryCodeExpired" = "Ми надіслали вам новий 6-значний код.";
"TwoStepAuth.RecoveryEmailUnavailable" = "Маєте труднощі з доступом до своєї е-пошти %@?";

"TwoStepAuth.FloodError" = "Ліміт вичерпано. Спробуйте знову пізніше.";
"TwoStepAuth.GenericError" = "Сталася помилка. Спробуйте знову пізніше.";

"Conversation.FilePhotoOrVideo" = "Фотографія чи відео";
"Conversation.FileICloudDrive" = "Сховище iCloud";
"Conversation.FileDropbox" = "Dropbox";
"Conversation.FileGoogleDrive" = "Диск Google";

"Conversation.FileHowTo" = "Як ділитися файлами?";
"Conversation.FileOpenIn" = "Відкрити в...";
"Conversation.FileHowToText" = "Для поширення файлів будь-якого типу, відкрийте їх в %@ (наприклад у браузері), торкніться **Відкрити в...** або кнопкою дії оберіть Telegram.";

"Map.LocationTitle" = "Розташування";
"Map.OpenInMaps" = "Відкрити в картах";
"Map.OpenInGooglePlus" = "Відкрити в Google Plus";
"Map.OpenInFoursquare" = "Відкрити в Foursquare";
"Map.OpenInHereMaps" = "Відкрити в картах HERE";
"Map.OpenInYandexMaps" = "Відкрити в картах Yandex";
"Map.OpenInYandexNavigator" = "Відкрити в Yandex навігаторі";
"Map.OpenIn" = "Відкрити в";
"Map.More" = "Більше...";

"Map.SendThisLocation" = "Надіслати це розташування";
"Map.SendMyCurrentLocation" = "Надіслати моє поточне розташування";
"Map.Locating" = "Визначення розташування...";
"Map.ChooseAPlace" = "Або виберіть місце";
"Map.AccurateTo" = "З точністю до %@";
"Map.Search" = "Пошук місць поблизу";
"Map.ShowPlaces" = "Показати місця";
"Map.LoadError" = "Сталася помилка. Спробуйте знову.";
"Map.LocatingError" = "Збій визначення розташування";
"Map.Unknown" = "Невідоме розташування";

"Map.DistanceAway" = "%@ звідси";
"Map.ETAMinutes_any" = "%@ хв";
"Map.ETAHours_1" = "%@ г";
"Map.ETAHours_any" = "%@ г";

"GoogleDrive.Title" = "Диск Google";
"GoogleDrive.Logout" = "Вийти";
"GoogleDrive.LogoutTitle" = "Вийти";
"GoogleDrive.LogoutMessage" = "Ви дійсно хочете вийти з Google Drive?";
"GoogleDrive.LogoutLogout" = "Вийти";
"GoogleDrive.FolderIsEmpty" = "Тека пуста.";
"GoogleDrive.FolderLoadError" = "Не вдалося завантажити теку.";
"GoogleDrive.LoadErrorTitle" = "Не вдалося з'єднатися";
"GoogleDrive.LoadErrorMessage" = "Будь ласка, перевірте з'єднання з інтернетом і повторіть спробу.";

"ChangePhone.ErrorOccupied" = "Номер %@ вже прив'язаний до облікового запису Telegram. Видаліть той обліковий запис перш, ніж перейти на новий номер.";

"AccessDenied.LocationTracking" = "Telegram потрібен доступ до вашого розташування, щоб показувати вас на карті.\n\nБудь ласка, перейдіть в Параметри > Приватність > Служба локації та увімкніть її.";

"PrivacySettings.AuthSessions" = "Активні сеанси";
"AuthSessions.Title" = "Активні сеанси";
"AuthSessions.CurrentSession" = "ПОТОЧНИЙ СЕАНС";
"AuthSessions.TerminateOtherSessions" = "Завершити всі інші сеанси";
"AuthSessions.TerminateOtherSessionsHelp" = "Завершує сеанси на всіх пристроях, крім поточного.";
"AuthSessions.TerminateSession" = "Завершити сеанс";
"AuthSessions.OtherSessions" = "АКТИВНІ СЕАНСИ";
"AuthSessions.EmptyTitle" = "Немає інших сеансів";
"AuthSessions.EmptyText" = "Ви можете увійти в Telegram з іншого мобільного телефона, планшета і настільних пристроїв, використовуючи такий самий номер телефону. Всі ваші дані будуть одразу ж синхронізовані.";
"AuthSessions.AppUnofficial" = "(ID: %@)";

"WebPreview.GettingLinkInfo" = "Отримання інформації про ланку";
"WebPreview.LinkPreview" = "Перегляд посилання";

"Preview.OpenInInstagram" = "Відкрити в Instagram";

"MediaPicker.AddCaption" = "Додати заголовок...";

"GroupInfo.InviteByLink" = "Запросити до групи послуговуючись ланкою";

"GroupInfo.InviteLink.Title" = "Ланка-запрошення";
"GroupInfo.InviteLink.LinkSection" = "ЛАНКА";
"GroupInfo.InviteLink.Help" = "Будь-хто з встановленим Telegram зможе приєднатися до вашої групи, перейшовши за посиланням.";
"GroupInfo.InviteLink.CopyLink" = "Копіювати ланку";
"GroupInfo.InviteLink.RevokeLink" = "Відкликати ланку";
"GroupInfo.InviteLink.ShareLink" = "Поширити ланку";
"GroupInfo.InviteLink.RevokeAlert.Text" = "Ви дійсно хочете відкликати це посилання? Як тільки ви це зробите, ніхто не зможе приєднатися до групи з його використанням.";
"GroupInfo.InviteLink.RevokeAlert.Revoke" = "Відкликати";
"GroupInfo.InviteLink.RevokeAlert.Success" = "Попередня ланка-запрошення неактивна. Нову ланку було тільки-но згенеровано.";
"GroupInfo.InviteLink.CopyAlert.Success" = "Ланку скопійовано до буферу обміну";

"UserInfo.ShareMyContactInfo" = "Поділитися контактними даними";

"GroupInfo.InvitationLinkAccept" = "Ви хочете приєднатися до чату \"%@\"?";
"GroupInfo.InvitationLinkAcceptChannel" = "Ви хочете приєднатися до каналу \"%@\"?";
"GroupInfo.InvitationLinkAlreadyAccepted" = "Ви вже є учасником цієї групи.";
"GroupInfo.InvitationLinkDoesNotExist" = "Вибачте, схоже, що ця група не існує.";
"GroupInfo.InvitationLinkGroupFull" = "Вибачте, ця група вже заповнена.";

"Core.ServiceUserStatus" = "Службові сповіщення";

"Notification.JoinedGroupByLink" = "%@ приєднався до групи послуговуючись ланкою-запрошенням";

"ChatSettings.Other" = "ІНШЕ";
"ChatSettings.Stickers" = "Наліпки";

"StickerPacksSettings.Title" = "Наліпки";
"StickerPacksSettings.ShowStickersButton" = "Показувати вкладку наліпок";
"StickerPacksSettings.ShowStickersButtonHelp" = "Піктограма наліпки з'явиться в полі введення.";

"StickerPacksSettings.StickerPacksSection" = "НАБОРИ НАЛІПОК";
"StickerPacksSettings.ManagingHelp" = "Вітаються художники для додавання їхніх власних наборів наліпок з використанням бота @stickers.\n\nКористувачі можуть додавати наліпки подвійним дотиком до них і обравши \"Додати наліпки\".";

"StickerPack.RemovePrompt" = "Вилучити \"%@\"?";
"StickerPack.BuiltinPackName" = "Видатні особистості";
"StickerPack.StickerCount_1" = "1 наліпка";
"StickerPack.StickerCount_2" = "2 наліпки";
"StickerPack.StickerCount_3_10" = "%@ наліпки";
"StickerPack.StickerCount_any" = "%@ наліпок";

"StickerPack.AddStickerCount_1" = "Додати 1 наліпку";
"StickerPack.AddStickerCount_2" = "Додати 2 наліпки";
"StickerPack.AddStickerCount_3_10" = "Додати %@ наліпки";
"StickerPack.AddStickerCount_any" = "Додати %@ наліпок";

"StickerPack.ShareStickers" = "Поширити наліпки";

"Conversation.ContextMenuStickerPackAdd" = "Додати наліпки";
"Conversation.ContextMenuStickerPackInfo" = "Інформація";

"MediaPicker.Processing" = "Обробка %@";
"MediaPicker.Nof" = "%@ із";

"UserInfo.ShareBot" = "Поділитися";
"UserInfo.InviteBotToGroup" = "Додати до групи";
"Profile.BotInfo" = "про";
"Profile.ShareBotPersonFormat" = "Поділитися ботом з %@?";
"Profile.ShareBotGroupFormat" = "Поділитися ботом з %@?";

"Target.SelectGroup" = "Обрати групу";
"Target.InviteToGroupConfirmation" = "Додати бота до \"%@\"?";
"Target.InviteToGroupErrorAlreadyInvited" = "Бот вже є учасником цієї групи.";
"Bot.GenericBotStatus" = "робот";
"Bot.DescriptionTitle" = "Що може робити цей бот?";
"Bot.GroupStatusReadsHistory" = "має доступ до повідомлень";
"Bot.GroupStatusDoesNotReadHistory" = "не має доступу до повідомлень";
"Bot.Start" = "Розпочати";
"UserInfo.BotSettings" = "Параметри";
"UserInfo.BotHelp" = "Довідка";

"Contacts.SearchLabel" = "Пошук контактів чи імен користувачів";
"ChatSearch.SearchPlaceholder" = "Пошук";

"WatchRemote.NotificationText" = "Відкрити це сповіщення у вашому телефоні для перегляду повідомлення з вашого годинника Apple";
"WatchRemote.AlertTitle" = "Повідомлення з вашого годинника Apple";
"WatchRemote.AlertText" = "Відкрити повідомлення тут?";
"WatchRemote.AlertOpen" = "Відкрити";

"Conversation.SearchPlaceholder" = "Пошук в цьому чаті";
"Conversation.SearchNoResults" = "Немає результатів";

"GroupInfo.AddUserLeftError" = "Вибачте, якщо особа покинула групу, лише спільний контакт може повернути її назад (вона повинна мати ваш номер, а ви її).";

"DialogList.SearchSectionRecent" = "Недавні";

"DialogList.DeleteBotConfirmation" = "Видалити";
"DialogList.DeleteBotConversationConfirmation" = "Видалити й зупинити";
"Bot.Stop" = "Зупинити бота";
"Bot.Unblock" = "Перезапуск бота";

"Login.PhoneNumberHelp" = "Довідка";
"Login.EmailPhoneSubject" = "Недійсний номер %@";
"Login.EmailPhoneBody" = "Я намагаюся  використати свій номер мобільного телефону: %@\nАле Telegram каже, що він недійсний. Будь ласка, допоможіть.";

"SharedMedia.TitleLink" = "Поширені посилання";
"SharedMedia.EmptyLinksText" = "Всі посилання, поширені в цьому чаті, з'являтимуться тут.";

"SharedMedia.Link_1" = "1 ланка";
"SharedMedia.Link_2" = "2 ланки";
"SharedMedia.Link_3_10" = "%@ посилання";
"SharedMedia.Link_any" = "%@ посилань";

"Compose.NewChannelButton" = "Новий канал";
"Channels.Title" = "Канали";

"Compose.NewChannel" = "Новий канал";
"GroupInfo.ChannelListNamePlaceholder" = "Назва каналу";

"Channel.MessagePhotoUpdated" = "Фотографію каналу оновлено";
"Channel.MessagePhotoRemoved" = "Фото каналу вилучено";
"Channel.MessageTitleUpdated" = "Канал перейменовано на \"%@\"";
"Channel.TitleInfo" = "Інформація каналу";

"Channel.UpdatePhotoItem" = "Встановити фотографію каналу";

"Channel.AboutItem" = "про";
"Channel.LinkItem" = "поділитись посиланням";
"Channel.Edit.AboutItem" = "Опис";
"Channel.Edit.LinkItem" = "Посилання";

"Channel.Username.Title" = "Посилання";
"Channel.Username.Help" = "Ви можете обрати назву каналу в **Telegram**. Якщо ви це зробите, інші користувачі зможуть знаходити ваш канал за цією назвою.\n\nВи можете використати **a-z**, **0-9** та підкреслювання. Мінімальна довжина **5** символів.";
"Channel.Username.LinkHint" = "Це посилання відкриває ваш канал в Telegram:[\nhttps://telegram.me/%@]";
"Channel.Username.InvalidTooShort" = "Назви каналів повинні містити щонайменше 5 символів.";
"Channel.Username.InvalidStartsWithNumber" = "Назви каналів не можуть починатися з цифри.";
"Channel.Username.InvalidCharacters" = "Вибачте, ця назва некоректна.";
"Channel.Username.InvalidTaken" = "На жаль, ця назва вже зайнята.";
"Channel.Username.CheckingUsername" = "Перевірка назви...";
"Channel.Username.UsernameIsAvailable" = "Ім'я %@ доступне. ";

"Channel.Share" = "Поділитися";
"Channel.LeaveChannel" = "Покинути канал";

"Channel.About.Title" = "Опис";

"Channel.About.Placeholder" = "Опис";
"Channel.About.Help" = "Ви можете додати необов'язковий опис для свого каналу.";
"Group.About.Help" = "Ви можете дати необов'язковий опис для своєї групи.";
"Channel.About.Error" = "Сталася помилка.";
"Channel.ShareNoLink" = "Оберіть посилання для свого каналу, щоб люди змогли знайти його через пошук.";

"Channel.Status" = "канал";
"Group.Status" = "група";

"Compose.NewChannel.Members" = "УЧАСНИКИ";
"Compose.NewChannel.AddMember" = "Додати учасника...";
"Compose.NewChannel.AddMemberHelp" = "Ви можете запросити свої контакти приєднатися до каналу прямо зараз, або додати їх пізніше.";
"Channel.NotificationSelfAdded" = "%@ додав/ла вас до цього каналу";

"ChannelInfo.ConfirmLeave" = "Покинути канал";
"Channel.JoinChannel" = "Приєднатися";
"Forward.ChannelReadOnly" = "Вибачте, ви не можете дописувати в цьому каналі.";

"Conversation.InfoChannel" = "Канал";

"Channel.ErrorAccessDenied" = "Вибачте, це приватний канал.";
"Conversation.InputTextBroadcastPlaceholder" = "Трансляція";

"Channel.NotificationCommentsEnabled" = "Коментарі увімкнено";
"Channel.NotificationCommentsDisabled" = "Коментарі вимкнено";
"Channel.Edit.EnableComments" = "Коментарі";

"Channel.TitleShowDiscussion" = "показати коментарі";
"Channel.ShareChannel" = "Поділитися";

"Channel.NotificationComments_1" = "1 коментар";
"Channel.NotificationComments_2" = "2 коментарі";
"Channel.NotificationComments_3_10" = "%@ коментарі";
"Channel.NotificationComments_any" = "%@ коментарів";
"Channel.NotificationLoading" = "Завантаження...";

"Conversation.InputTextDisabledPlaceholder" = "Коментарі вимкнено";
"Compose.ChannelTokenListPlaceholder" = "Пошук контактів чи імен користувачів";
"Compose.GroupTokenListPlaceholder" = "Пошук контактів чи імен користувачів";

"Compose.ChannelMembers" = "Учасники";

"Channel.Setup.TypeHeader" = "ТИП КАНАЛУ";
"Channel.Setup.TypePrivate" = "Приватний";
"Channel.Setup.TypePublic" = "Публічний";
"Channel.Setup.TypePublicHelp" = "Публічні канали можна знайти через пошук, будь-хто може приєднатися до них.";
"Channel.Setup.TypePrivateHelp" = "Вхід в приватні канали можливий лише за посиланням.";

"Channel.Setup.Title" = "Канал";

"Channel.Username.CreatePublicLinkHelp" = "Люди можуть ділитися цим посиланням і знаходити ваш канал через пошук в Telegram.";
"Channel.Username.CreatePrivateLinkHelp" = "Люди можуть приєднуватись до вашого каналу, перейшовши за цим посиланням. Ви можете відкликати це посилання будь-коли.";

"Channel.Username.CreateCommentsEnabled" = "Коментарі";
"Channel.Username.CreateCommentsHelp" = "Якщо ви увімкнете коментарі, учасники матимуть змогу обговорювати ваші дописи на каналі.";

"Channel.Setup.PublicNoLink" = "Виберіть посилання для свого публічного каналу, таким чином люди зможуть знаходити його через пошук і ділитися з іншими.\n\nЯкщо вас це не цікавить, рекомендуємо натомість створити приватний канал.";

"Channel.Edit.PrivatePublicLinkAlert" = "Майте на увазі, якщо ви оберете публічне посилання, будь-хто зможе знайти його через пошук і приєднатися.\n\nНе створюйте це посилання, якщо ви хочете залишити свій канал приватним.";

"Channel.Info.Description" = "опис";

"Channel.Info.Management" = "Admins";
"Channel.Info.BlackList" = "Чорний список";
"Channel.Info.Members" = "Учасники";

"Channel.Members.AddMembers" = "Додати учасників";
"Channel.Members.AddMembersHelp" = "Only channel admins can see this list.";
"Channel.Members.Title" = "Учасники";
"Channel.BlackList.Title" = "Чорний список";
"Channel.Management.Title" = "Admins";
"Channel.Management.LabelCreator" = "Творець";
"Channel.Management.LabelModerator" = "Модератор";
"Channel.Management.LabelEditor" = "Admin";

"Channel.Management.AddModerator" = "Add Admin";
"Channel.Management.AddModeratorHelp" = "You can add admins to help you manage your channel.";

"Channel.Members.Kick" = "Вилучити";
"Channel.Management.Remove" = "Вилучити";

"Conversation.InputTextCommentPlaceholder" = "Коментар";

"Channel.Members.InviteLink" = "Запросити посиланням";

"Channel.Management.ErrorNotMember" = "%@ ще не приєднався до каналу. Хочете запросити його?";

"Channel.Moderator.AccessLevelHeader" = "РІВЕНЬ ДОПУСКУ";
"Channel.Moderator.AccessLevelEditor" = "Редактор";
"Channel.Moderator.AccessLevelModerator" = "Модератор";

"Channel.Moderator.AccessLevelModeratorHelp" = "Модератори можуть видаляти коментарі користувачів і керувати чорним списком каналу.\n\nМодератори не можуть змінювати назву каналу, посилання, фотографію та опис.";
"Channel.Moderator.AccessLevelEditorHelp" = "Редактори можуть робити дописи від імені каналу, керувати чорним списком і видаляти дописи.\n\nРедактори не можуть змінювати назву каналу, посилання, фотографію та опис.";
"Channel.Moderator.AccessLevelRevoke" = "Звільнити модератора";

"Channel.Moderator.Title" = "Модератор";

"Notification.ChannelInviter" = "%@ запросив/ла вас до цього каналу";
"Notification.ChannelInviterSelf" = "Ви приєдналися до цього каналу";

"Notification.GroupInviter" = "%@ запросив/ла вас до цієї групи";
"Notification.GroupInviterSelf" = "Ви приєдналися до цієї групи";

"ChannelInfo.DeleteChannel" = "Видалити канал";
"ChannelInfo.DeleteChannelConfirmation" = "Заждіть! Видалення цього каналу видалить всіх його учасників і всі повідомлення. Все одно видалити?";

"Channel.Username.InvalidTooManyUsernames" = "Вибачте, ви створили забагато публічних каналів. Ви можете спочатку або створити приватний канал, або видалити один із наявних каналів.";

"ChannelInfo.ChannelForbidden" = "Шкода, але цей канал більше недоступний.";

"PhotoEditor.FadeTool" = "Вицвітання";
"PhotoEditor.TintTool" = "Відтінок";
"PhotoEditor.TintIntensity" = "Інтенсивність відтінку";
"PhotoEditor.ShadowsTint" = "Тіні";
"PhotoEditor.HighlightsTint" = "Виділення";
"PhotoEditor.CurvesTool" = "Викривлення";
"PhotoEditor.CurvesAll" = "Все";
"PhotoEditor.CurvesRed" = "Червоний";
"PhotoEditor.CurvesGreen" = "Зелений";
"PhotoEditor.CurvesBlue" = "Блакитний";

"Channel.ErrorAddBlocked" = "Вибачте, але ви не можете додати цього користувача до каналів.";
"Channel.ErrorAddTooMuch" = "Шкода, але ви можете додати до каналу лише перших 200 учасників. Майте на увазі, що до каналу може приєднатися необмежена кількість людей за посиланням.";

"ChannelIntro.Title" = "Що таке канал?";
"ChannelIntro.Text" = "Канали - це новий інструмент для\nтрансляції ваших повідомлень\nширокій аудиторії.";
"ChannelIntro.CreateChannel" = "Створити канал";

"ShareMenu.Send" = "Надіслати";

"Conversation.ReportSpam" = "Повідомити про спам";
"Conversation.ReportSpamConfirmation" = "Ви дійсно хочете повідомити про спам від цього користувача?";
"SharedMedia.EmptyMusicText" = "Вся музика, поширена в цьому чаті, з'являтиметься тут.";

"ChatSettings.AutoPlayAnimations" = "Автовідтворення GIF";

"GroupInfo.ChatAdmins" = "Додати адміністраторів";

"ChatAdmins.Title" = "Адміністратори чату";
"ChatAdmins.AllMembersAreAdmins" = "Всі учасники є адміністраторами";
"ChatAdmins.AllMembersAreAdminsOnHelp" = "Всі учасники можуть додавати нових учасників, змінювати ім'я та фотографію групи.";
"ChatAdmins.AllMembersAreAdminsOffHelp" = "Лише адміністратори можуть додавати й вилучати учасників, змінювати ім'я та фотографію групи.";
"ChatAdmins.AdminLabel" = "адміністратор";

"Group.MessagePhotoUpdated" = "Фотографію групи оновлено";
"Group.MessagePhotoRemoved" = "Фотографію групи вилучено";
"Group.MessageTitleUpdated" = "Групу перейменовано на \"%@\"";

"Group.UpgradeNoticeHeader" = "ДОСЯГНУТО МЕЖУ УЧАСНИКІВ";

"Group.UpgradeNoticeText1" = "Щоб перейти за межу й отримати додаткові можливості, оновіться до супергрупи:";
"Group.UpgradeNoticeText2" = "•  Супергрупи можуть досягати до {supergroup_member_limit} учасників\n•  Нові учасники бачать повну історію чату\n•  Адміністратори видаляють повідомлення для кожного\n•  Звук сповіщень типово вимкнено";
"GroupInfo.UpgradeButton" = "Оновити до супергрупи";
"Group.UpgradeConfirmation" = "Warning: this action is irreversible. It is not possible to downgrade a supergroup to a regular group.";

"Notification.GroupMigratedToChannel" = "Група була оновлена до супергрупи";
"Notification.GroupDeactivated" = "Група деактивована";
"Notification.GroupDeactivated" = "Група деактивована";
"Notification.ChannelMigratedFrom" = "Ця група була оновлена до супергрупи";

"Conversation.StatusGroupDeactivated" = "група деактивована";
"GroupInfo.DeactivatedStatus" = "Група деактивована";

"Notification.RenamedGroup" = "Група перейменована";

"Group.ErrorAddTooMuch" = "Шкода, але ця група заповнена.";
"Group.ErrorAddTooMuchBots" = "Вибачте, ви досягли максимальної кількості ботів для цієї групи.";
"Group.ErrorAddTooMuchAdmins" = "Вибачте, ви досягли максимальної кількості адміністраторів для цієї групи.";
"Group.ErrorAddBlocked" = "Вибачте, ви не можете додати цього користувача до груп.";
"Group.ErrorNotMutualContact" = "Вибачте, в даний момент ви можете додавати до груп лише спільні контакти.";

"Conversation.SendMessageErrorFlood" = "Вибачте, в даний момент ви можете надсилати повідомлення лише спільним контактам.";
"Generic.ErrorMoreInfo" = "Докладніше";

"Notification.InvitedMany" = "%@ запросив/ла %@";

"ChannelMembers.Blacklist.EmptyText" = "Користувачі, занесені в чорний список, вилучаються з групи та можуть повернутися лише за запрошенням адміністратора. Запрошення посиланням для них не працює.";

"ChannelInfo.DeleteGroup" = "Видалити групу";
"ChannelInfo.DeleteGroupConfirmation" = "Заждіть! Видалення цієї групи вилучить всіх учасників і всі повідомлення будуть втрачені. Все одно видалити групу?";

"ReportPeer.Report" = "Повідомити";

"ReportPeer.ReasonSpam" = "Спам";
"ReportPeer.ReasonViolence" = "Насильство";
"ReportPeer.ReasonPornography" = "Порнографія";
"ReportPeer.ReasonOther" = "Інше";

"ReportPeer.AlertSuccess" = "Дякуємо!\nВаше повідомлення буде невдовзі розглянуто нашою командою.";

"Login.TermsOfServiceLabel" = "Увійшовши,\nви погоджуєтесь з [Terms of Service].";
"Login.TermsOfServiceHeader" = "Умови використання";

"ReportPeer.ReasonOther.Placeholder" = "Опис";
"ReportPeer.ReasonOther.Title" = "Повідомити";
"ReportPeer.ReasonOther.Send" = "Надіслати";

"Group.Management.AddModeratorHelp" = "You can add admins to help you manage your group.";

"Watch.AppName" = "Telegram";
"Watch.Compose.AddContact" = "Вибрати контакт";
"Watch.Compose.CreateMessage" = "Створити повідомлення";
"Watch.Compose.CurrentLocation" = "Поточне розташування";
"Watch.Compose.Send" = "Надіслати";
"Watch.Contacts.NoResults" = "Не знайдено\nвідповідних контактів";
"Watch.ChatList.NoConversationsTitle" = "Немає розмов";
"Watch.ChatList.NoConversationsText" = "Щоб написати повідомлення,\nнатисніть сильно, потім оберіть\nНове повідомлення";
"Watch.ChatList.Compose" = "Нове повідомлення";

"Watch.Conversation.Reply" = "Відповісти";
"Watch.Conversation.Unblock" = "Розблокувати";
"Watch.Conversation.UserInfo" = "Інфо";
"Watch.Conversation.GroupInfo" = "Інформація групи";
"Watch.Bot.Restart" = "Перезапуск";

"Watch.UserInfo.Title" = "Інфо";
"Watch.UserInfo.Service" = "службові сповіщення";

"Watch.UserInfo.Block" = "Блокувати";
"Watch.UserInfo.Unblock" = "Розблокувати";
"Watch.UserInfo.Mute_1" = "Вимкнути на 1 годину";
"Watch.UserInfo.Mute_2" = "Вимкнути на 2 години";
"Watch.UserInfo.Mute_3_10" = "Вимкнути на %@ години";
"Watch.UserInfo.Mute_any" = "Вимкнути на %@ години";
"Watch.UserInfo.Mute" = "Вимкнути звук";
"Watch.UserInfo.Unmute" = "Увімкнути";

"Watch.GroupInfo.Title" = "Інформація групи";
"Watch.ChannelInfo.Title" = "Інформація каналу";

"Watch.Message.ForwardedFrom" = "Переслано від";

"Watch.Notification.Joined" = "Приєднався/лась до Telegram";

"Watch.MessageView.Title" = "Повідомлення";
"Watch.MessageView.Forward" = "Переслати";
"Watch.MessageView.Reply" = "Відповісти";
"Watch.MessageView.ViewOnPhone" = "Дивитися на телефоні";

"Watch.PhotoView.Title" = "Фотографія";

"Watch.Stickers.Recents" = "Недавні";
"Watch.Stickers.RecentPlaceholder" = "Ваші найчастіші наліпки з'являтимуться тут";
"Watch.Stickers.StickerPacks" = "Набори наліпок";

"Watch.Location.Current" = "Поточне розташування";
"Watch.Location.Access" = "Дозволити Telegram доступ до розташування на вашому телефоні";

"Watch.AuthRequired" = "Увійдіть в Telegram на своєму телефоні, щоб почати";
"Watch.UnlockRequired" = "Розблокувати Telegram на своєму телефоні";

"Watch.NoConnection" = "Немає з'єднання";
"Watch.ConnectionDescription" = "Ваш годинник повинен бути під'єднаний для роботи програми";

"Watch.State.Connecting" = "З'єднання...";
"Watch.State.Updating" = "Оновлення...";
"Watch.State.WaitingForNetwork" = "Немає мережі";

"Watch.Time.ShortTodayAt" = "Сьогодні %@";
"Watch.Time.ShortYesterdayAt" = "Вчора %@";
"Watch.Time.ShortWeekdayAt" = "%1$@ %2$@";
"Watch.Time.ShortFullAt" = "%1$@ %2$@";

"Watch.LastSeen.JustNow" = "Щойно";
"Watch.LastSeen.MinutesAgo_1" = "1 хвилину тому";
"Watch.LastSeen.MinutesAgo_2" = "2 хвилини тому";
"Watch.LastSeen.MinutesAgo_3_10" = "%@ хвилини тому";
"Watch.LastSeen.MinutesAgo_any" = "%@ хвилин тому";
"Watch.LastSeen.HoursAgo_1" = "1 годину тому";
"Watch.LastSeen.HoursAgo_2" = "2 години тому";
"Watch.LastSeen.HoursAgo_3_10" = "%@ години тому";
"Watch.LastSeen.HoursAgo_any" = "%@ годин тому";
"Watch.LastSeen.TodayAt" = "сьогодні о %@";
"Watch.LastSeen.YesterdayAt" = "вчора о %@";
"Watch.LastSeen.AtWeekday" = "%@";
"Watch.LastSeen.AtDate" = "%@";
"Watch.LastSeen.Lately" = "недавні";
"Watch.LastSeen.WithinAWeek" = "упродовж тижня";
"Watch.LastSeen.WithinAMonth" = "упродовж місяця";
"Watch.LastSeen.ALongTimeAgo" = "давно";

"Watch.Suggestion.OK" = "ОК";
"Watch.Suggestion.ThankYou" = "Дякуємо.";
"Watch.Suggestion.Thanks" = "Дякуємо!";
"Watch.Suggestion.WhatsUp" = "Як справи?";
"Watch.Suggestion.Yes" = "Так";
"Watch.Suggestion.No" = "Ні";
"Watch.Suggestion.Absolutely" = "Абсолютно";
"Watch.Suggestion.Nope" = "Ні";
"Watch.Suggestion.TalkLater" = "Поговоримо пізніше?";
"Watch.Suggestion.CantTalk" = "Не можу говорити зараз...";
"Watch.Suggestion.HoldOn" = "Зачекай секунду...";
"Watch.Suggestion.CallSoon" = "Скоро подзвоню.";
"Watch.Suggestion.TextInABit" = "Напишу за хвильку.";
"Watch.Suggestion.BRB" = "Зараз повернусь";
"Watch.Suggestion.OnMyWay" = "Я в дорозі.";
"Cache.Photos" = "Фотографії";
"Cache.Videos" = "Відео";
"Cache.Music" = "Музика";
"Cache.Files" = "Файли";
"Cache.Clear" = "Стерти (%@)";
"Cache.ClearNone" = "Стерти";
"Cache.ClearProgress" = "Будь ласка, зачекайте...";
"Cache.ClearEmpty" = "Порожньо";
"Cache.ByPeerHeader" = "ЧАТИ";
"Cache.Indexing" = "Telegram розраховує поточний розмір кешу.\nЦе може тривати кілька хвилин.";

"ExplicitContent.AlertTitle" = "Вибачте";
"ExplicitContent.AlertChannel" = "Ви не можете отримати доступ до цього каналу, тому що він порушує правила App Store.";
"ExplicitContent.AlertUser" = "Ви не можете отримати доступ до цього бота, тому що він порушує правила App Store.";

"StickerSettings.ContextHide" = "Приховати";
"StickerSettings.ContextShow" = "Показати";

"Conversation.LinkDialogSave" = "Зберегти";
"Conversation.GifTooltip" = "Торкніться тут для доступу до збережених GIF";

"AttachmentMenu.PhotoOrVideo" = "Фотографія чи відео";
"AttachmentMenu.ImageSearch" = "Пошук зображення";
"AttachmentMenu.File" = "Файл";

"AttachmentMenu.SendPhoto_1" = "Надіслати 1 фотографію";
"AttachmentMenu.SendPhoto_2" = "Надіслати 2 фотографії";
"AttachmentMenu.SendPhoto_3_10" = "Надіслати %@ фотографії";
"AttachmentMenu.SendPhoto_any" = "Надіслати %@ фотографій";

"AttachmentMenu.SendVideo_1" = "Надіслати 1 відео";
"AttachmentMenu.SendVideo_2" = "Надіслати 2 відео";
"AttachmentMenu.SendVideo_3_10" = "Надіслати %@ відео";
"AttachmentMenu.SendVideo_any" = "Надіслати %@ відео";

"AttachmentMenu.SendGif_1" = "Надіслати 1 GIF";
"AttachmentMenu.SendGif_2" = "Надіслати 2 GIF";
"AttachmentMenu.SendGif_3_10" = "Надіслати %@ GIF";
"AttachmentMenu.SendGif_any" = "Надіслати %@ GIF";

"AttachmentMenu.SendItem_1" = "Надіслати 1 елемент";
"AttachmentMenu.SendItem_2" = "Надіслати 2 елементи";
"AttachmentMenu.SendItem_3_10" = "Надіслати %@ елементи";
"AttachmentMenu.SendItem_any" = "Надіслати %@ елементів";

"AttachmentMenu.SendAsFile" = "Надіслати файл";
"AttachmentMenu.SendAsFiles" = "Надіслати файли";

"Conversation.Processing" = "Обробка...";

"Conversation.MessageViaUser" = "через %@";

"CreateGroup.SoftUserLimitAlert" = "Ви зможете додати більше користувачів після завершення створення групи, а також перетворити її в супергрупу.";
"ChannelMembers.AllMembersMayInvite" = "Всі учасники можуть запрошувати";
"ChannelMembers.AllMembersMayInviteOnHelp" = "Кожен може додавати нових учасників.";
"ChannelMembers.AllMembersMayInviteOffHelp" = "Лише адміністратори можуть додавати нових учасників.";

"Privacy.GroupsAndChannels" = "В групових чатах";
"Privacy.GroupsAndChannels.WhoCanAddMe" = "ХТО МОЖЕ ДОДАВАТИ МЕНЕ ДО ГРУПОВИХ ЧАТІВ";
"Privacy.GroupsAndChannels.CustomHelp" = "Ви можете з високою точністю встановити обмеження на додавання вас до груп і каналів.";
"Privacy.GroupsAndChannels.AlwaysAllow" = "Завжди дозволяти";
"Privacy.GroupsAndChannels.NeverAllow" = "Ніколи не дозволяти";
"Privacy.GroupsAndChannels.CustomShareHelp" = "Ці користувачі зможуть або не зможуть додавати вас до груп та каналів, в залежності від ваших налаштувань вгорі.";

"Privacy.GroupsAndChannels.AlwaysAllow.Title" = "Завжди дозволяти";
"Privacy.GroupsAndChannels.AlwaysAllow.Placeholder" = "Завжди дозволяти...";
"Privacy.GroupsAndChannels.NeverAllow.Title" = "Ніколи не дозволяти";
"Privacy.GroupsAndChannels.NeverAllow.Placeholder" = "Ніколи не дозволяти...";

"Privacy.GroupsAndChannels.InviteToGroupError" = "Вибачте, але ви не можете додавати %@ до груп, через параметри приватності %@.";
"Privacy.GroupsAndChannels.InviteToChannelError" = "Вибачте, але ви не можете додавати %@ до каналів, через параметри приватності %@.";
"Privacy.GroupsAndChannels.InviteToChannelMultipleError" = "Вибачте, але ви не можете створити групу з цими користувачами, через їхні параметри приватності.";

"ChannelMembers.WhoCanAddMembers" = "Хто може додавати учасників";
"ChannelMembers.WhoCanAddMembers.AllMembers" = "Всі учасники";
"ChannelMembers.WhoCanAddMembers.Admins" = "Лише адміністратори";
"ChannelMembers.WhoCanAddMembersAllHelp" = "Кожен може додавати нових учасників.";
"ChannelMembers.WhoCanAddMembersAdminsHelp" = "Лише адміністратори можуть додавати нових учасників.";

"ChannelMembers.GroupAdminsTitle" = "АДМІНІСТРАТОРИ ГРУПИ";
"ChannelMembers.ChannelAdminsTitle" = "АДМІНІСТРАТОРИ КАНАЛУ";
"MusicPlayer.VoiceNote" = "Голосове повідомлення";

"PrivacyLastSeenSettings.WhoCanSeeMyTimestamp" = "ХТО МОЖЕ БАЧИТИ МІЙ ВІДБИТОК ЧАСУ";

"PrivacyLastSeenSettings.GroupsAndChannelsHelp" = "Змінити, хто може додавати вас до груп і каналів.";
"MusicPlayer.VoiceNote" = "Голосове повідомлення";

"Watch.Microphone.Access" = "Дозволити Telegram доступ до мікрофона вашого телефона";

"Settings.AppleWatch" = "Годинник Apple";
"AppleWatch.Title" = "Годинник Apple";
"AppleWatch.ReplyPresets" = "НАБОРИ ВІДПОВІДЕЙ";
"AppleWatch.ReplyPresetsHelp" = "Під час відповіді на повідомлення ви можете вибрати одну з цих типових відповідей, або змінити їх на будь-які інші.";

"KeyCommand.FocusOnInputField" = "Написати повідомлення";
"KeyCommand.Find" = "Пошук";
"KeyCommand.ScrollUp" = "Вгору";
"KeyCommand.ScrollDown" = "Вниз";
"KeyCommand.NewMessage" = "Нове повідомлення";
"KeyCommand.JumpToPreviousChat" = "Попередній чат";
"KeyCommand.JumpToNextChat" = "Наступний чат";
"KeyCommand.JumpToPreviousUnreadChat" = "Попередній непрочитаний чат";
"KeyCommand.JumpToNextUnreadChat" = "Наступний непрочитаний чат";
"KeyCommand.SendMessage" = "Надіслати повідомлення";
"KeyCommand.ChatInfo" = "Інформація чату";

"Conversation.SecretLinkPreviewAlert" = "Чи бажаєте увімкнути розширений вигляд посилання в секретних чатах? Зауважте, що вигляд посилань генерується на серверах Telegram.";
"Conversation.SecretChatContextBotAlert" = "Зауважте, що вбудовані боти надаються розробниками третіх сторін. Для роботи бота, введені вами символи після імені користувача бота надсилаються відповідному розробнику.";

"Map.OpenInWaze" = "Відкрити у Waze";

"ShareMenu.CopyShareLink" = "Copy Link";

"Channel.SignMessages" = "Підписувати повідомлення";
"Channel.SignMessages.Help" = "Додавати імена адміністраторів до їхніх повідомлень.";

"Channel.EditMessageErrorGeneric" = "Вибачте, але ви не можете змінити це повідомлення.";

"ChannelInfo.InvitationLinkDoesNotExist" = "Вибачте, але схоже, що цей канал не існує.";

"Conversation.InputTextSilentBroadcastPlaceholder" = "Тиха трансляція";
"Conversation.SilentBroadcastTooltipOn" = "Учасники будуть сповіщені про ваш допис";
"Conversation.SilentBroadcastTooltipOff" = "Учасники не будуть сповіщені про ваш допис";

"Settings.About" = "Bio";
"GroupInfo.LabelAdmin" = "admin";

"Conversation.Pin" = "Прикріпити";
"Conversation.Unpin" = "Відкріпити";
"Conversation.Report" = "Report Spam";
"Conversation.PinnedMessage" = "Прикріплене повідомлення";

"Conversation.Moderate.Delete" = "Delete Message";
"Conversation.Moderate.Ban" = "Ban User";
"Conversation.Moderate.Report" = "Report Spam";
"Conversation.Moderate.DeleteAllMessages" = "Delete All From %@";

"Group.Username.Help" = "You can choose a group name on **Telegram**. If you do, other people will be able to find your group by this name.\n\nYou can use **a-z**, **0-9** and underscores. Minimum length is **5** characters.";

"Group.Username.InvalidTooShort" = "Назви груп повинні мати принаймні 5 символів.";
"Group.Username.InvalidStartsWithNumber" = "Назви груп не можуть починатися з номера.";

"Group.Username.LinkHint" = "This link opens your group in Telegram:[\nhttps://telegram.me/%@]";

"Notification.PinnedTextMessage" = "%@ pinned \"%@\"";
"Notification.PinnedPhotoMessage" = "%@ pinned a photo";
"Notification.PinnedVideoMessage" = "%@ pinned a video";
"Notification.PinnedAudioMessage" = "%@ pinned a voice message";
"Notification.PinnedDocumentMessage" = "%@ pinned a file";
"Notification.PinnedAnimationMessage" = "%@ pinned a GIF";
"Notification.PinnedStickerMessage" = "%@ pinned a sticker";
"Notification.PinnedLocationMessage" = "%@ pinned a map";
"Notification.PinnedContactMessage" = "%@ pinned a contact";
"Notification.PinnedDeletedMessage" = "%@ pinned deleted message";

"Message.PinnedTextMessage" = "pinned \"%@\"";
"Message.PinnedPhotoMessage" = "pinned photo";
"Message.PinnedVideoMessage" = "pinned video";
"Message.PinnedAudioMessage" = "pinned voice message";
"Message.PinnedDocumentMessage" = "pinned file";
"Message.PinnedAnimationMessage" = "pinned GIF";
"Message.PinnedStickerMessage" = "pinned sticker";
"Message.PinnedLocationMessage" = "pinned location";
"Message.PinnedContactMessage" = "pinned contact";
"Message.PinnedDeletedMessage" = "pinned deleted message";

"Notification.PinnedMessage" = "pinned message";

"GroupInfo.ConvertToSupergroup" = "Конвертувати в Супергрупу";

"ConvertToSupergroup.Title" = "Supergroup";
"ConvertToSupergroup.HelpTitle" = "**In supergroups:**";
"ConvertToSupergroup.HelpText" = "• New members can see the full message history\n• Deleted messages will disappear for all members\n• Members can edit their own messages\n• Creator can set a public link for the group";

"ConvertToSupergroup.Note" = "**Note**: this action can't be undone.";

"GroupInfo.GroupType" = "Тип групи";

"Group.Setup.TypeHeader" = "GROUP TYPE";
"Group.Setup.TypePublicHelp" = "Публічні групи можна знаходити через пошук, історія чату доступна кожному і будь-хто може приєднатися.";
"Group.Setup.TypePrivateHelp" = "До приватних груп можна приєднатися лише за особистим запрошенням, або за запрошувальним посиланням.";

"Group.Username.CreatePublicLinkHelp" = "Люди можуть ділитися цим посиланням з іншими та знаходити вашу групу через пошук Telegram.";
"Group.Username.CreatePrivateLinkHelp" = "People can join your group by following this link. You can revoke the link at any time.";

"Conversation.PinMessageAlertGroup" = "Pin this message and notify all members of the group?";
"Conversation.PinMessageAlertChannel" = "Pin this message and notify all members of the channel?";
"Conversation.PinMessageAlert.OnlyPin" = "Only Pin";

"Conversation.UnpinMessageAlert" = "Would you like to unpin this message?";

"Settings.About.Title" = "Bio";
"Settings.About.Help" = "You can add a few lines about yourself. Anyone who opens your profile will see this text.";

"Profile.About" = "bio";

"Group.Management.ErrorNotMember" = "%@ hasn't joined the group yet. Do you want to invite them?";

"Conversation.ReportSpamAndLeave" = "Report Spam and Leave";

"Conversation.StatusKickedFromChannel" = "you were removed from the channel";

"Generic.OpenHiddenLinkAlert" = "Open %@?";

"Resolve.ErrorNotFound" = "Sorry, this user doesn't seem to exist.";
